{
  "status": "OK",
  "request_id": "587e7bd4-e20c-4bb9-99e4-8d5bd02b3609",
  "parameters": {
    "query": "Lawyer jobs in Alicante",
    "page": 1,
    "num_pages": 1,
    "date_posted": "all",
    "employment_types": [
      "FULLTIME"
    ],
    "radius": 20,
    "country": "es",
    "language": "es"
  },
  "data": [
    {
      "job_id": "fA5FCA2m5AeqbTSZAAAAAA==",
      "job_title": "Lawyer",
      "employer_name": "AirAdvisor",
      "employer_logo": null,
      "employer_website": "https://airadvisor.com",
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/1544066291524960256?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/1544066291524960256?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "Please, only apply if you have a valid Attorney at Law license and are authorized to practice law by the Regulation Authority in SPAIN, and you have litigation experience in Spain.* Instead of a CV, please attach a simple Word file describing your experience in airline passenger claims under EU261/2004 or baggage claims under Montreal Convention in English.\nWhether it's a delay, cancellation, missed connection, or an airline-related issue like overbooking. In June 2025, we introduced a new service for baggage claims related to lost, delayed, or destroyed luggage. Currently operating in 21 languages (with nine more forthcoming this year), AirAdvisor is an ambitious and fast-growing startup with a clear vision for international expansion. We are seeking a skilled and dedicated Litigation Lawyer specializing in consumer flight claims (typically via small claims procedures) to lead in-court collections. You will be responsible for filing batches of court cases to collect compensation and/or reimbursement of Out-of-Pocket Expenses (OPE) incurred by passengers and/or recover ticket refunds. If the law or a judge decides the case unfairly, we would consider escalating this to change the law, if feasible. There may be PR opportunities to highlight court victories and key legal issues that deserve public attention. A valid Attorney at Law license in Spain and professional liability insurance.\nA law degree from an accredited institution.\nExperience with small claims, consumer rights, or aviation law is a plus, but is not required.\nKnowledge of relevant consumer protection laws and aviation regulations is a plus, but is not required.\nStrong analytical and problem-solving skills to assess case merits, conduct legal research, and develop effective legal strategies.\nAct as the legal representative of AirAdvisor in Spain, handling all legal matters and claims filed within the jurisdiction. If setting up a law firm in Spain were feasible, you would be expected to assist in this matter, including, but not limited to, corporate structuring, registering Mr. Anton Radchenko on the official list of foreign legal counsels in Spain, and other formalities.\n200+ legal new claims monthly in Spanish courts against various airlines for the purpose of recovering:\n(a) Compensation under EU Regulation 261/2004 and/or Turkish SHY Regulation for flight delays, cancellations, and denied boarding.\n(b) Reimbursement of out-of-pocket expenses incurred by passengers under EU261/2004, and/or the Montreal Convention.\n(c) Ticket refunds owed to passengers under applicable legal frameworks.\n(Respond comprehensively and assertively to airline legal defenses, including substantive arguments as well as procedural and jurisdictional challenges.\nMaintain complete and accurate legal case files, ensuring all work complies with Spanish legal ethics, data protection regulations, and professional standards. Conduct thorough legal research and comparative analysis to compile best practices for managing recurring legal issues in airline and consumer rights litigation.\nStay informed about developments in consumer protection law, aviation regulations, EU regulations, and judicial precedents in order to provide updated, authoritative legal advice and representation.\nWhere applicable, and if a court decision is rendered unjustly, pursue legal remedies, including appeals, and advocate for legislative changes, if strategically and procedurally feasible.\nSupport the optimization and automation of claims management workflows, leveraging legal technology solutions, including AI-based tools, to improve efficiency and scalability.\nIdentify and propose new civil claims business opportunities that are viable under Spanish law and offer low-value, high-volume litigation potential. a) Bank and financial disputes, Labour law-related claims, etc.\n(b) Conduct cross-jurisdictional legal research, primarily across EU and UK markets, to identify relevant precedents and advanced practices that may be adapted for use in Spain in more complex claim scenarios.\nRepresent AirAdvisor in local media, including giving interviews to press outlets, television broadcasters, and podcast programs. Coordinate with AirAdvisor's PR Manager to take advantage of public relations opportunities surrounding landmark court rulings or critical legal developments, with the goal of enhancing public awareness of consumer rights.\nReview and vet content as needed, aka serve as in-country content reviewer of record to help build local trust and boost authority.\nAdvocate for passenger and consumer rights within the airline and travel industry, promoting fair treatment and legal protection for air travellers.\nRemote-first culture with flexible start and end times. Paid Time Off & Public Holidays – because work-life balance matters.\nAnnual pay review and performance-based bonuses.\nProfessional Growth Opportunities – work on a global expansion and new market entry.\nJob Type: Indefinite-term Freelancing Contract / Service Agreement or a B2B Contract.\nWhile we cannot provide a standard employment contract in your country of residence, we aim to establish a stable and long-term partnership. For this reason, we offer an indefinite-term contract arrangement.\nPlease do research about our company and industry, and be prepared to discuss your achievements. If you would like to be among the first to know about our new job openings, company business updates, new services, and rankings related to the airports, airlines, and aviation industry, please follow our LinkedIn company page and our social media profiles.",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DfA5FCA2m5AeqbTSZAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "CRsW5ucdgzHp5AlBAAAAAA==",
      "job_title": "Legal Counsel (m/w/d) (m/w/d)",
      "employer_name": "Xiaomi Technology",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS11VEizncskblGBTH8ZA5QcAdAw6np33w-GCy2&s=0",
      "employer_website": null,
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/3172041140761264128?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/3172041140761264128?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "The position will include the following tasks:\n\n1. Manage and lead all kinds of projects related to Anti-Trust investigations including RFIs.\n\n2. Provide advice to the management and business team on all aspects of antitrust compliance.\n\n3. Provide advice on the implementation and impact of the DMA.\n\n4. Assess current and future business models from an Anti-Trust perspective.\n\n5. Plan, organize and implement the European Anti-Trust Compliance Program.\n\n6. Provide Anti-Trust Compliance trainings on a regular basis.\n\n7. Provide leadership and support on a wide variety of Anti-Trust matters.\n\n8. Constant monitoring and learning of new trends and laws.\n\nCandidate Profile:\n\n1. Experienced lawyer with at least 4 years PQE.\n\n2. Experience in advising on complex Anti-Trust matters/investigations.\n\n3. Excellent communication (written and oral) and interpersonal skills in English.\n\n4. Strong commercial sense and pragmatism.\n\n5. Ability to multi-task, prioritize and handle tight deadlines.\n\n6. Ability to work both independently and in a team environment.\n\n7. Ability to work precisely and flexibly at the same time\n\n8. Candidates without the above qualification and proven experience/expertise cannot be considered. Please note that this is an office-based position.",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DCRsW5ucdgzHp5AlBAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "ncS4QtDtNJZ0fQLtAAAAAA==",
      "job_title": "Abogado Inmigración Remoto / Remote Immigration Lawyer",
      "employer_name": "NIM Immigration Lawyers",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jobijoba",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobijoba.es/oferta-empleo/69/47720822f6ff90b5746c66e90588c3a9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobijoba",
          "apply_link": "https://www.jobijoba.es/oferta-empleo/69/47720822f6ff90b5746c66e90588c3a9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/amp/job/es-alacant-abogado-inmigraci-n-remoto-remote-immigration-lawyer-nim?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Abogado Inmigración Remoto España / Remote Immigration Lawyer Spain\n\n¿Eres abogado/a de inmigración y buscas colaborar de forma flexible y totalmente online?\n\nEn NIM Immigration Lawyers, un despacho legal especializado en movilidad internacional y visados para nómadas digitales, buscamos un/a profesional freelance para colaborar con nosotros en la atención y gestión de los expedientes de inmigración de nuestros clientes internacionales.\n\nRequisitos:\n• Disponibilidad inmediata y diaria para colaborar como autónomo/a\n• Imprescindible dominio fluido del inglés profesional y experiencia en el trato con clientes internacionales\n• Imprescindible dominio y experiencia práctica en la tramitación del permiso de teletrabajo internacional (Digital Nomad Visa)\n• Conocimiento práctico de todos los permisos de residencia contemplados en la Ley General de Extranjería y la Ley de Emprendedores 14/2013\n• Estar dado/a de alta en régimen de autónomos (RETA)\n• Formación en Derecho (ideal con colegiación -aunque no requerido)\n\nQué ofrecemos:\n• Colaboración estable con flujo constante de clientes\n• Comisiones por captación y gestión de expedientes\n• Trabajo 100% remoto y flexible\n• Entorno digital, joven y emprendedor\n\nSi te encaja, ¡no dudes en contactarnos y unirte a nuestro equipo!",
      "job_is_remote": false,
      "job_posted_at": "hace 3 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DncS4QtDtNJZ0fQLtAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "1oMmAQwZMnyIq97iAAAAAA==",
      "job_title": "Litigation Lawyer for Airline Passengers Claims",
      "employer_name": "AirAdvisor",
      "employer_logo": null,
      "employer_website": "https://airadvisor.com",
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/5734329088076677120?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/5734329088076677120?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "WhatJobs",
          "apply_link": "https://es.whatjobs.com/legal-counsel-jobs?id=284388329&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Recruit.net",
          "apply_link": "https://www.recruit.net/job/litigation-lawyer-airline-passengers-claims-jobs/B065A38F42798CDA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-alacant-litigation-lawyer-for-airline-passengers-claims-airadvisor?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "*Please, only apply if you have a valid Attorney at Law license and are authorized to practice law by the Regulation Authority in SPAIN, and you have litigation experience in Spain.*\nInstead of a CV,\nplease attach a simple Word file describing your experience in airline passenger claims under EU261/2004 or baggage claims under Montreal Convention\nin English.\nAbout Us\n✈️At\nAirAdvisor , we are dedicated to ensuring air travelers receive the compensation they are entitled to for flight disruptions. Whether it’s a\ndelay, cancellation, missed connection , or an airline-related issue like\noverbooking . In June 2025, we introduced a new service for baggage claims related to lost, delayed,\nor destroyed luggage . We are present in the EU, the UK, and other international markets, with a focus on protecting the rights of air passengers globally. We have successfully processed over\n530,000 claims\nfor clients from\n221 countries , earning a\n4.7-star rating\nbased on over\n27,800 reviews . Currently operating in\n21 languages\n(with nine more forthcoming this year), AirAdvisor is an ambitious and fast-growing startup with a clear vision for international expansion. We plan to reach\n1 million claims by the end of 2026.\n✈️\nWe are seeking a skilled and dedicated\nLitigation Lawyer\nspecializing in consumer flight claims (typically via minor claims procedures) to lead in-court collections. A team of paralegals manages pre-court collections. You will be responsible for filing batches of court cases to collect compensation and/or reimbursement of Out-of-Pocket Expenses (OPE) incurred by passengers and/or recover ticket refunds. AirAdvisor currently handles three types of airline claims:\nEU261\ncompensation for flight delays, cancellations, and denied boarding, as well as two types of baggage claims under the\nMontreal Conventio n: lost and delayed luggage.\nIf the law or a judge decides the case unfairly, we would consider escalating this to change the law. There may be PR opportunities to highlight court victories and key legal issues that deserve public attention. This is an excellent opportunity for high performers who can self-perform, have substantial litigation experience, and have a passion for advocating consumer rights in the airline industry.\nThe candidate must be free from conflicts of interest, meaning they are free to litigate claims against different airlines.\nRequirements:\nA valid Attorney at Law license in Spain and professional liability insurance.\nA law degree from an accredited institution.\nExperience with small claims, consumer rights, or aviation law is a plus, but is not required.\nKnowledge of relevant consumer protection laws and aviation regulations is a plus, but is not required.\nProven track record of success in in-court collection.\nStrong analytical and problem-solving skills to assess case merits, conduct legal research, and develop effective legal strategies.\nAbility to manage a caseload, prioritize tasks, meet deadlines, and track statute of limitations.\nExperience in automating and standardizing claims management processes to scale up quickly.\nResponsibilities:\nAct as the legal representative of AirAdvisor in Spain , handling all legal matters and claims filed within the jurisdiction. If setting up a law firm in Spain were feasible, you would be expected to assist in this matter, including, but not limited to, corporate structuring, registering Mr. Anton Radchenko on the official list of foreign legal counsels in Spain, and other formalities.\nPre-court collections and out-of-court settlements.\nPrepare and file batches of approx. 200+ legal new claims monthly in Spanish courts against various airlines\nfor the purpose of recovering:\n(a) Compensation under\nEU Regulation 261/2004\nand/or\nTurkish SHY Regulation\nfor flight delays, cancellations, and denied boarding.\n(b) Reimbursement of\nout-of-pocket expenses\nincurred by passengers under EU261/2004, and/or the Montreal Convention.\n(c)\nTicket refunds\nowed to passengers under applicable legal frameworks.\n(d)\nHandle baggage-related claims , including cases of delayed, damaged, or lost luggage, in accordance with the provisions of the Montreal Convention and/or Warsaw Convention.\nRespond comprehensively and assertively to airline legal defenses , including substantive arguments as well as procedural and jurisdictional challenges.\nLead the enforcement of court judgments , including initiating enforcement proceedings and coordinating with bailiffs or enforcement authorities when necessary.\nEngage in court-led settlement negotiations , and where applicable, represent AirAdvisor’s interests in securing favorable in-court settlements.\nMaintain complete and accurate legal case files , ensuring all work complies with Spanish legal ethics, data protection regulations, and professional standards. Conduct thorough\nlegal research and comparative analysis\nto compile best practices for managing recurring legal issues in airline and consumer rights litigation.\nStay informed about developments in consumer protection law , aviation regulations, EU regulations, and judicial precedents to provide updated, authoritative legal advice and representation.\nWhere applicable, and if a court decision is rendered unjustly,\npursue legal remedies, including appeals , and\nadvocate for legislative changes , if strategically and procedurally feasible.\nSupport the optimization and automation of claims management workflows , leveraging legal technology solutions, including AI-based tools, to improve efficiency and scalability.\nIdentify and propose new civil claims business opportunities\nthat are viable under Spanish law and offer low-value, high-volume litigation potential. Areas may include, but are not limited to:\n(a)\nBank and financial disputes, Labour law-related claims,\netc.\n(b)\nConduct cross-jurisdictional legal research , primarily across EU and UK markets, to identify relevant precedents and advanced practices that may be adapted for use in Spain in more complex claim scenarios.\nRepresent AirAdvisor in local media , including giving interviews to press outlets, television broadcasters, and podcast programs. Coordinate with AirAdvisor’s PR Manager to take advantage of public relations opportunities surrounding landmark court rulings or critical legal developments, to enhance public awareness of consumer rights.\nReview and vet content as needed, aka serve as in-country content reviewer of record to help build local trust and boost authority.\nAdvocate for passenger and consumer rights\nwithin the airline and travel industry, promoting fair treatment and legal protection for air travellers.\nWe offer:\nRemote-first culture\nwith flexible start and end times. Your working hours will be easily registered in our time-tracking application, allowing you to adjust your working day according to your needs and capacities.\nPaid Time Off & Public Holidays\n– because work-life balance matters.\nAnnual pay review\nand performance-based bonuses.\nProfessional Growth Opportunities\n– work on a\nglobal expansion and new market entry.\nDynamic work and a chance to learn how to\nutilize your skills in an absolutely new way.\nSupportive Team Culture\n– Work with intelligent, passionate, and friendly colleagues who value collaboration.\nInternational Team\n- our colleagues are located in\n13 countries\naround the globe.\nJob Type : Indefinite-term Freelancing Contract / Service Agreement or a B2B Contract.\nWhile we cannot provide a standard employment contract in your country of residence, we aim to establish a stable and long-term partnership. For this reason, we offer an indefinite-term contract arrangement.\nIf you're ready to take on a\nhigh-impact role\nin a fast-growing company, apply now, and let's fight for airline passenger rights globally!\nOur Recruitment Process:\nApplication screening:\nIf your profile matches our current business needs, our Talent Acquisition Manager will invite you to the HR interview.\nHR interview : Please research our company and industry, and be prepared to discuss your achievements. If you wish, you can send us a summary of your accomplishments in advance of the interview, allowing us to better prepare for the conversation.\nInterview with the CEO:\nOur CEO will discuss your functional experience, achievements, and technical skills in more detail.\n✈️\nJoin us and bring LegalTech & TravelTech innovation to the next level! ✈️\nIf you would like to be among the first to know about our new job openings, company business updates, new services, and rankings related to the airports, airlines, and aviation industry,\nplease follow our LinkedIn company page and our social media profiles.",
      "job_is_remote": false,
      "job_posted_at": "hace 3 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D1oMmAQwZMnyIq97iAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "bdjTqniUIfnAfj6DAAAAAA==",
      "job_title": "Corporate Lawyer Opportunity",
      "employer_name": "beBeeCareer",
      "employer_logo": null,
      "employer_website": "https://us.bebee.com",
      "job_publisher": "Jobilize",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobilize.com/job/es-alicante-corporate-lawyer-opportunity-bebeecareer-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-alicante-corporate-lawyer-opportunity-bebeecareer-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Corporate law professionals are in high demand, and this role offers the perfect opportunity to grow your career.\nSummary\n\nOur team of experts provides comprehensive legal advice and solutions to our clients and internal stakeholders. We strive for compliance with regulations and minimize legal risks across various industries.\n\nWe specialize in corporate law, advising and supporting clients on matters such as mergers and acquisitions, corporate governance, and compliance. Our professionals leverage their experience in navigating complex legal frameworks.\nJob Requirements\n• A law degree or double degree in Law and Business Administration (ADE)\n• A Master's degree for legal practice (mandatory); specialization master's is a plus\n• Between 2 and 5 years of proven experience in a law firm or Big4, advising on Commercial Law and/or Procedural Law for companies\n• High proficiency in spoken and written English\n• Ability to work autonomously and organize multiple procedures simultaneously\n• Strong communication skills, especially with clients; business-oriented and motivated by projects\n• Teamwork and management skills\n• Proactivity, flexibility, and ability to work under pressure\n• International network experience is a plus\nBenefits\n\nImmediate incorporation available.",
      "job_is_remote": false,
      "job_posted_at": "hace 4 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DbdjTqniUIfnAfj6DAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "uSzYrmt8rJ9-OXWLAAAAAA==",
      "job_title": "Commercial Lawyer",
      "employer_name": "Legal.io",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5-dl7LkWJnCTwqRQLTsq5IRLTM4zMKTAXYFNC&s=0",
      "employer_website": "https://www.legal.io",
      "job_publisher": "Spain Jobs Expertini",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.expertini.com/job/commercial-lawyer-alacant-legalio-3874-10603739/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Spain Jobs Expertini",
          "apply_link": "https://es.expertini.com/job/commercial-lawyer-alacant-legalio-3874-10603739/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "A leading data privacy, security, and compliance software company is seeking an experienced commercial counsel to assist their company on a full-time (40 hours per week), contract basis for an initial 5-month term.\n\nTitle: Commercial Counsel (Secondment)\n\nExperience: 7+ Years\n\nLocation: Hybrid (London or Madrid)\n\nDuration: 5 Months\n\nHours: 40 Hours / Week\n\nPay Rate: $100 - $120 USD / hr\n\nTechnology: Ironclad, Salesforce\n\nSenior Counsel, Commercial to provide transactional support on commercial contracts. This role manages complex legal matters with minimal supervision, serves as a trusted advisor to business stakeholders, and plays a key part in shaping best practices within the Commercial & Product Support team.\n\nRequirements:\n• Negotiate and close complex SaaS agreements with enterprise customers, including in highly regulated industries.\n• Includes handling any informal disputes that may arise out of agreements\n• Own and resolve sophisticated transactional commercial matters independently and lead smaller projects or workstreams.\n• Handle ad-hoc legal requests for support from the sales function and other business units.\n• Serve as a trusted advisor by balancing legal risk with commercial priorities.\n• Understand key IP, commercial, and finance requirements.\n• Privacy experience as it pertains Commercial Contracts.\n• Ability to negotiate DPAs.\n• Drive compliance in day-to-day sales activities, including providing training.\n• Assist with wider company projects assigned to the Commercial & Product Support team.\n\nQualifications:\n• 6+ years of transactional legal experience on complex customer contracts.\n• An excellent communicator and negotiator.\n• A strategic thinker who considers available information, potential consequences, and organizational goals when making decisions.\n• An excellent project manager and able to take ownership of stakeholders and solutions.\n• Self-motivated, able to manage multiple priorities, and thrive in a fast-paced environment.\n• Able to effectively communicate, both verbal and written, with all levels of the organization.\n• Meticulous and pride yourself with attention to detail and accuracy.\n• Adaptable to change and thrive in a fast-paced environment.\n• Highly organized.\n\nBonus:\n• Public-Sector, Privacy, GRC, Third-Party Risk, AI Governance experience.",
      "job_is_remote": false,
      "job_posted_at": "hace 28 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DuSzYrmt8rJ9-OXWLAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "txTOiJg0ixK2uercAAAAAA==",
      "job_title": "Senior Associate Dispute Resolution – IP",
      "employer_name": "Noerr LLP",
      "employer_logo": null,
      "employer_website": "https://www.noerr.com",
      "job_publisher": "Learn4Good",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.learn4good.com/jobs/alicante/espana/leyes_and_legales/4643482197/s/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Learn4Good",
          "apply_link": "https://www.learn4good.com/jobs/alicante/espana/leyes_and_legales/4643482197/s/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "(Senior) Associate Dispute Resolution – IP (w/m/d) page is loaded## (Senior) Associate Dispute Resolution – IP (w/m/d) locations:\nAlicanteposted on:\nPosted Yesterdayjob requisition :\nJR3957##\n• * Was Dich bei uns erwartet:\n• * Wachse mit und an den Besten:\nIn einem der international renommiertesten IP-Teams entwickelst Du an der Seite von Dr. Tobias Dolde, Michael Hawkins und Zuzana Peniaskova Lösungen für hoch anspruchsvolle juristische Fragen – und Dich weiter. Als Einsteiger/in ebenso wie als erfahrene Kraft immer aber als Teil des Teams. Denn gemeinsam leben wir eine Kultur der kollaborativen Exzellenz, in der gemeinsamer Erfolg und persönlicher Fortschritt einander bedingen und beflügeln.\n\nÜberzeuge Dich selbst und lerne unser\n• * Alicante\n• * Team persönlich kennen. Wir freuen uns auf Dich!\n\nWir beraten bei komplexen, internationalen Streitigkeiten, die für unsere Mandanten typischerweise eine große strategische Bedeutung haben. Zu unseren Kernkompetenzen gehören:\n• * Praxisgruppe Intellectual Property\n• ** Verfahren vor dem EUIPO in Alicante\n• Internationale IP-Prosecution\n• IP-Strategie und Portfoliomanagement (Marken und Designs)\n• Verfahren vor den europäischen Gerichten in Luxemburg\n• grenzüberschreitende IP-Litigation\n• IP-Lizenzen\n• Domainrecht* Begleitung internationaler IP-Transaktionen\n• Steuerliche IP-Optimierung##\n• * Was wir Dir bieten:\n• ** Ein offenes dynamisches und internationales Team, das für Dich da ist, wenn es darauf ankommt\n• Spannende internationale Mandate mit enger Einbindung und unmittelbaren Mandantenkontakt, damit Du von Beginn an wachsen kannst\n• Vielfältige Karriereperspektiven und individuelle Entwicklungsmöglichkeiten\n• Ein umfassendes Aus- und Weiterbildungsprogramm, das Dir ermöglicht, Deine persönlichen Stärken und fachlichen Interessen weiter auszubilden und zu vertiefen##\n• * Was Du mitbringen solltest:\n• ** Hervorragende juristische Qualifikationen und sehr gute Englischkenntnisse\n• Zusatzqualifikationen wie ein LL.M. oder eine Promotion sind uns willkommen\n• Interesse an wirtschaftlichen Fragestellungen\n• Neugierde und Spaß an internationalen Herausforderungen\n• Lust auf Teamwork und Eigenverantwortung##\n• * Contact:\n• * Alexandra Kremer - HR-Business Partner - +49 (89) 28628\n-3553\n\nNoerr gives advice in all areas of commercial law. Our practice groups are efficiently networked, and this guarantees innovative legal advice with effective, value-creating solutions. Moreover, our \"focused full service\" profile is a mark of our commitment to flat hierarchies and to a high measure of self-determination among our specialist fields, partners and teams. For young lawyers, this independence provides an ideal platform for specialisation.\nOur client base is similarly diverse, ranging from listed and multinational groups to large and medium-sized family firms, financial institutions and international investors. Our lawyers thus experience the most varied scenarios for handling consultancy projects entrepreneurially.\nHere are all our fields of law, practice groups and industry solutions at a\n#J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 6 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DtxTOiJg0ixK2uercAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "DZ8sgtKdWFw3ey16AAAAAA==",
      "job_title": "Senior Lawyer",
      "employer_name": "Iridium Concesiones de Infraestructuras S A",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCK6XJsp36mT8dlFvb2UNa4-nXrYxXdjcqhfP-&s=0",
      "employer_website": "https://iridiumconcesiones.com",
      "job_publisher": "Jobilize",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobilize.com/job/es-alacant-senior-lawyer-iridium-concesiones-de-infraestructuras-s?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-alacant-senior-lawyer-iridium-concesiones-de-infraestructuras-s?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "IRIDIUM, Concesiones de Infraestructuras S.A., a leading international company in the development, financing and long-term operation and maintenance of infrastructure projects, wholly owned by the ACS Group, is looking for a Senior Lawyer with the profile detailed below to join its Legal Department.\n\nPROFILE\n\nSenior lawyer specialised in infrastructures, concessions and energy; with extensive experience in bidding process, M&A, corporate financing and project finance; drafting and negotiating contracts; being involved in management of commercial companies; able to get involved in the operational aspects of the business; and work in a dynamic and global environment.\n\nDUTIES AND RESPONSIBILITIES\n\nProviding legal advice on the various activities of the company and its subsidiaries, in collaboration with the different company departments and throughout the different stages of business.\nThis role would be part of the company's Legal Department and report to the Head of the Legal Department.\nThe position covers, among others, the following functions:\n• Drafting and negotiating financing contracts, security packages, structured financing (project finance) and refinancing.\n• Involved in the preparation of bids and project development, (i) providing advice in public or private pre-qualification and bidding processes, within the framework of PPP projects or similar structures, real estate and energy and (ii) drafting and negotiating contracts (MoU, EPC, O&M, construction contracts, non-binding and final offers, interfaces agreements, NDAs and term sheets for financing).\n• Advice in the fields of infrastructure and energy, including regulatory law, project agreements, public contracts, permits, etc.\n• Corporate and commercial management of SPVs / concessionaire companies (legal secretary work and corporate transactions of varying complexity) and M&A transactions (SPA, SHA, due diligence, etc.).\n• Coordination and monitoring of proceedings before international courts and arbitration tribunals in various matters, including civil, commercial, contentious-administrative, etc…\n• Management, coordination and monitoring of the actions carried out by external lawyers.\n\nREQUIREMENTS\n\n1.- Education\n• Law Degree and registered as a lawyer.\nA double degree is desirable.\n• MBA, LLM or any program related to finance.\n• Bilingual level of English (70% of the work is in English).\nExperience working in English in an international context is required.\n• Advanced use of office automation tools for the management of legal documentation and information and the preparation of executive presentations.\n\n2.- Experience\n• Experience in international operations in the fields of infrastructures, energy and project finance, 3-7 years (preferably at least 3 years in a recognised law firm with specialised areas in the fields required for this profile).\n• Experience in advising on financial, commercial and regulatory law.\n• Experience working with multidisciplinary teams.\n• Experience leading or working in legal teams on complex projects (partners, advisors, etc.).\n• Experience in litigation (mainly in administrative and commercial litigation).\n\nSkills and competences\n• Strategic thinking:\na proactive, results-oriented approach.\nAbility to provide robust legal advice in highly demanding environments, to assess legal risks and to propose viable and safe solutions.\n• Organisational, teamwork and time management skills to meet tight deadlines.\n• Adaptability and continued development, ability to learn and work in dynamic environments and work with digital legal management tools in shared environments.\n• Willingness to travel.\n\nWE OFFER\n• Permanent contract.\n• Professional development in a leading company in infrastructure concessions management, continuously evolving.\n• Salary based on candidate's qualifications.\n• 24 working days of vacation.\n• Parking.\n• Other social benefits.\n\nIRIDIUM is a company committed to diversity, inclusion, respect, equal treatment, and opportunities, as well as the fight against discrimination in all its forms.\nTherefore, this offer is open to all individuals who meet the required qualifications, regardless of their background, circumstances, or condition",
      "job_is_remote": false,
      "job_posted_at": "hace 15 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DDZ8sgtKdWFw3ey16AAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "8Kw4md2lYcuh1CTXAAAAAA==",
      "job_title": "Senior Commercial Legal Advisor (Alicante (Alacant))",
      "employer_name": "HBX Group",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRPTr7jZlr_QQ_PHxNe-UYQJgXeeD-UKlhTEncO&s=0",
      "employer_website": "https://www.hbxgroup.com",
      "job_publisher": "Jobijoba",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobijoba.es/oferta-empleo/69/dd93c64c8d73b840390f35a57e0054db?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobijoba",
          "apply_link": "https://www.jobijoba.es/oferta-empleo/69/dd93c64c8d73b840390f35a57e0054db?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Senior Commercial Legal Advisor\n\nLocation Spain\n\nFull time\n\nAbout Us\n\nHBX Group is the world’s leading technological partner, connecting and empowering the world of travel. We’re game-changers, disruptors, the people who bring together local and general brands in accommodation, transport, activities and payments through our network of 300,000 hotels worldwide, 60,000 hard to reach high value clients such as tour operators, travel agents and loyalty schemes across 140 source markets. We are tech-driven, with a customer-first philosophy, and commercial teams whose knowledge and relationships on the ground are second to none. And of course we have an amazing team! Our people, Team HBX Group, are the beating heart of the company who we encourage to ‘move fast, dream big and make the difference’ every day. In fact, we believe that it is tech + data + people that truly sets us apart in the market, alongside our ‘global approach, local touch’ mentality.\n\nRole Summary\n\nThe Senior Legal Counsel will play a pivotal role in supporting Roiback’s commercial operations and strategic initiatives. This position is responsible for reviewing, drafting, and negotiating a wide range of commercial agreements, providing legal education to commercial teams, and leading legal aspects of key strategic projects. The role also involves managing external legal advisors and potentially leading internal team members.\n\nKey Responsibilities\n\n- Contract Management:\n\n- Review, draft, and negotiate all types of commercial agreements to ensure proper documentation of relationships, obligations, and responsibilities between Roiback and external parties.\n\n- Legal Education & Training:\n\n- Deliver legal training and share materials with commercial teams to raise awareness of legal topics impacting strategy and operations. Provide guidance on negotiation, drafting, risk mitigation, and best practices.\n\n- Strategic Project Leadership:\n\n- Act as the legal lead in strategic Roiback projects, offering early guidance on legal implications, requirements, and risk assessments.\n\n- Team Leadership:\n\n- Manage and mentor team members, fostering a culture of engagement and continuous improvement.\n\n- Process Optimization:\n\n- Reshape current ways of working by improving, simplifying, and designing contract templates, guidelines, and procedures aligned with Roiback’s dynamic environment.\n\n- External Counsel Coordination:\n\n- Oversee external legal advisors across jurisdictions, ensuring efficient service delivery, cost control, and alignment with business goals. Act as the primary liaison between external counsel and internal stakeholders.\n\nQualifications & Experience\n\n- Minimum 8 years of experience as an in-house legal counsel, with a focus on commercial or technology law.\n\n- Proven experience working within and leading teams, with a track record of inspiring high levels of employee engagement.\n\n- Hands-on experience with contract business volumes and pricing, including proficiency in tools such as Excel.\n\n- Law degree from a reputable institution;\n\na double degree in Business Administration is strongly preferred.\n\n- Business-level proficiency in both English and Spanish.\n\nAt HBX Group, we believe that diversity drives innovation and makes travel a force for good.\n\nWe're committed to creating an inclusive workplace where everyone feels valued and\n\nrespected, embracing different backgrounds, perspectives and talents. Join us and be part\n\nof a team where diversity and equal opportunities really do make a difference.",
      "job_is_remote": false,
      "job_posted_at": "hace 6 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D8Kw4md2lYcuh1CTXAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    },
    {
      "job_id": "ScUgBvimEnjioV8AAAAAAA==",
      "job_title": "(Senior) Associate Dispute Resolution – IP",
      "employer_name": "Noerr Alicante IP, S.L.",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5BSMIt7m2uiId_3142LNElhU-kvf9h48rIEOM&s=0",
      "employer_website": "https://www.noerr.com",
      "job_publisher": "Trabajo.org",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.trabajo.org/oferta-3144-75991f9223a6db75a39412431f465dab?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Trabajo.org",
          "apply_link": "https://es.trabajo.org/oferta-3144-75991f9223a6db75a39412431f465dab?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Was Dich bei uns erwartet: Wachse mit und an den Besten: In einem der international renommiertesten IP-Teams entwickelst Du an der Seite von Dr. Tobias Dolde, Michael Hawkins und Zuzana Peniaskova Lösungen für hoch anspruchsvolle juristische Fragen – und Dich weiter. Als Einsteiger/in ebenso wie als erfahrene Kraft immer aber als Teil des Teams. Denn gemeinsam leben wir eine Kultur der kollaborativen Exzellenz, in der gemeinsamer Erfolg und persönlicher Fortschritt einander bedingen und beflügeln. Überzeuge Dich selbst und lerne unser Alicante Team persönlich kennen. Wir freuen uns auf Dich Wir beraten bei komplexen, internationalen Streitigkeiten, die für unsere Mandanten typischerweise eine große strategische Bedeutung haben. Zu unseren Kernkompetenzen gehören: Praxisgruppe Intellectual Property Verfahren vor dem EUIPO in Alicante Internationale IP-Prosecution IP-Strategie und Portfoliomanagement (Marken und Designs) Verfahren vor den europäischen Gerichten in Luxemburg grenzüberschreitende IP-Litigation IP-Lizenzen Domainrecht Begleitung internationaler IP-Transaktionen Steuerliche IP-Optimierung Was wir Dir bieten: Ein offenes dynamisches und internationales Team, das für Dich da ist, wenn es darauf ankommt Spannende internationale Mandate mit enger Einbindung und unmittelbaren Mandantenkontakt, damit Du von Beginn an wachsen kannst Vielfältige Karriereperspektiven und individuelle Entwicklungsmöglichkeiten Ein umfassendes Aus- und Weiterbildungsprogramm, das Dir ermöglicht, Deine persönlichen Stärken und fachlichen Interessen weiter auszubilden und zu vertiefen Was Du mitbringen solltest: Hervorragende juristische Qualifikationen und sehr gute Englischkenntnisse Zusatzqualifikationen wie ein LL.M. oder eine Promotion sind uns willkommen Interesse an wirtschaftlichen Fragestellungen Neugierde und Spaß an internationalen Herausforderungen Lust auf Teamwork und Eigenverantwortung",
      "job_is_remote": false,
      "job_posted_at": "hace 7 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Alicante (Alacant)",
      "job_city": "Alicante (Alacant)",
      "job_state": "Alicante",
      "job_country": "ES",
      "job_latitude": 38.3457685,
      "job_longitude": -0.4909444,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DScUgBvimEnjioV8AAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "23101100",
      "job_onet_job_zone": "5"
    }
  ]
}