{
  "status": "OK",
  "request_id": "e54ae710-74a9-42e4-afc2-3bb8361eb077",
  "parameters": {
    "query": "Solutions Architect jobs in Madrid",
    "page": 1,
    "num_pages": 3,
    "date_posted": "all",
    "country": "es",
    "language": "es"
  },
  "data": [
    {
      "job_id": "-vflOnZ5EZ8e4CwqAAAAAA==",
      "job_title": "AI Solutions Architect",
      "employer_name": "atmira",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLCbW_aByLJEgNMMEm7OMrxId4YW4LpUA9ETM1&s=0",
      "employer_website": "https://www.atmira.com",
      "job_publisher": "LinkedIn",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.linkedin.com/jobs/view/ai-solutions-architect-at-atmira-4341928395?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/ai-solutions-architect-at-atmira-4341928395?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "BeBee",
          "apply_link": "https://es.bebee.com/job/a06b1580e25790cad3836a3174be093c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "JobzMall",
          "apply_link": "https://www.jobzmall.com/vodafone/job/ai-solutions-architect-eqoa248xez?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/6137461109390573568?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Talent.com",
          "apply_link": "https://es.talent.com/view?id=bb642fed1a46&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Trabajo.org",
          "apply_link": "https://es.trabajo.org/oferta-2635-296763691878a42ea1781d29ed0ce518?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Sercanto",
          "apply_link": "https://www.sercanto.es/detail/a/ai-solutions-architect_madrid_188317887?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-ai-solutions-architect-bebeemachinelearning-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "¡Atención, amante de la tecnología! Si eres una persona curiosa, creativa y con pasión por la innovación, ¡esta oportunidad es para ti!\n\nEn nuestro equipo, buscamos mentes inquietas como la tuya, dispuestas a formar parte de Comunidades tecnológicas donde construir conjuntamente. ¡Prepárate para un viaje emocionante!\n\nPero, antes de nada, ¿nos presentamos?\n\nSomos atmira, un ecosistema de interacción centrado en las personas. Nuestro objetivo es ayudarte a desarrollarte tanto personal como profesionalmente. A través de nuestro Club, podrás relacionarte, vivir experiencias profesionales y alcanzar tus metas.\n\nEn atmira, tú eres el protagonista y tienes el poder de explorar tu potencial con #Icouldbe\n\nY ahora que ya nos conocemos un poco más… ¿A qué te vas a dedicar?\n\nTus funciones principales serán las siguientes:\n\nDiseño de Arquitecturas GenAI:\n• Liderar el diseño, la planificación y la evolución de arquitecturas de IA generativa, incluyendo la selección de modelos, la orquestación y la integración con sistemas existentes.\n• Especializarse en la implementación de Arquitecturas de Generación Aumentada por Recuperación (RAG), incluyendo la selección de bases de datos vectoriales, estrategias de \"chunking\", optimización de la recuperación y la integración de LLMs.\n• Diseñar y supervisar la implementación de pipelines de procesamiento de datos para la ingesta, limpieza, transformación y vectorialización de datos para sistemas RAG.\n\nDesarrollo de Agentes de IA y Workflows:\n• Arquitectar y desarrollar sistemas de agentes de IA sofisticados, incluyendo agentes autónomos, multi-agentes y sistemas de colaboración humano-agente.\n• Utilizar y evaluar frameworks de orquestación de LLMs como LangChain, LangGraph, CrewAI o Autogen para construir workflows complejos y con estado.\n• Definir patrones para la creación de \"tools\" (herramientas) para agentes, permitiendo la interacción con sistemas externos y fuentes de datos.\n\nSelección y Optimización de LLMs:\n• Evaluar, seleccionar y recomendar LLMs (modelos propietarios y open-source) para casos de uso específicos, considerando factores como el rendimiento, el costo, la latencia y la seguridad.\n• Aplicar técnicas de Prompt Engineering, \"fine-tuning\" y \"distillation\" para optimizar el rendimiento y la eficiencia de los modelos\n\nLiderazgo Técnico y Colaboración:\n• Proporcionar liderazgo técnico y mentoría a los equipos de ingenieros y científicos de datos, fomentando las mejores prácticas en el desarrollo de IA.\n• Colaborar estrechamente con Product Owners, científicos de datos, ingenieros de machine learning y equipos de operaciones para traducir los requisitos de negocio en soluciones técnicas.\n\nRendimiento, Escalabilidad y Seguridad:\n• Diseñar soluciones que sean escalables, de alto rendimiento, resilientes y eficientes en términos de costos en entornos de producción.\n• Asegurar que las soluciones de IA generativa cumplan con los estándares de seguridad, privacidad de datos y cumplimiento normativo.\n• Definir estrategias de monitoreo, logging y observabilidad para los sistemas de IA en producción.\n\n¿Con qué tecnología trabajarás principalmente?\n• Experiencia en el diseño e implementación de sistemas basados en LLMs en entornos de producción.\n• Profundo conocimiento y experiencia práctica con arquitecturas RAG, incluyendo la integración de bases de datos vectoriales (ej., Pinecone, Weaviate, Chroma, Qdrant)\n• Dominio de frameworks de orquestación de LLMs, con experiencia práctica en LangChain y/o LangGraph.\n• Experiencia en el diseño y desarrollo de agentes de IA y sistemas multi-agente.\n• Fuerte dominio de Python y sus librerías para IA/ML.\n• Experiencia con plataformas de cloud computing (AWS, Azure, GCP) y sus servicios de IA/ML relevantes (ej., Amazon Bedrock, Azure OpenAI Service, Google Cloud AI Platform/Vertex AI).\n\n¿Te resulta interesante? Aún tenemos mucho más que contarte:\n\n🌱 Un fantástico equipo de personas que te ayudarán a desarrollarte y encontrar tu sitio dentro de una empresa dinámica, innovadora y ágil.\n\n🏘️ Open Spaces, espacios abiertos al conocimiento que facilitan la colaboración y una metodología de trabajo híbrida, flexible y sostenible.\n\n💼 Metodología Smart Working: modelo híbrido de teletrabajo.\n\n⏰ Horario flexible.\n\n📅 Jornada intensiva viernes, julio y agosto.\n\n🏖️ Vacaciones: 23 días.\n\n🌟 Atmira Flex: ticket restaurant, abono de metro, seguro médico y guardería a tu disposición en nuestra plataforma de retribución flexible.\n\n👟 Con nuestra Comunidad de Ambassadors siempre estarás activ_: deportes, aventura, planes por la ciudad…\n\n💎¿Colegas del sector? con nuestro Programa de referenciad_s tráel_s a trabajar contigo y recibe un bonus por referenciarl_s.\n\n💻 Dispondrás de una ayuda económica para el wifi si trabajas desde casa. Además de recibir el Home office pack en casa: silla, pantalla, teclado…\n\n🍎 En la oficina siempre encontraras fruta a tu disposición.\n\n🧠 ¿Te duele algo? No te preocupes, tenemos servicios a tu disposición para cuidar tu cuerpo y mente: fisio, talleres de bienestar y diferentes deportes que practicar en equipo.\n\nSeguimos con la ronda de presentaciones, y ¿adivina qué?... ¡es tu turno! ¿te sumas a mover atmira? atmira comprometida con la Igualdad",
      "job_is_remote": false,
      "job_posted_at": "hace 13 horas",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D-vflOnZ5EZ8e4CwqAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "yF-ppzHAyDVPQ814AAAAAA==",
      "job_title": "Solution Architect (AWS & Azure)",
      "employer_name": "NEORIS",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ5acXV0m8mAfRErl2nrRy-fJjIO4Buhv6JGxo0&s=0",
      "employer_website": null,
      "job_publisher": "LinkedIn",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.linkedin.com/jobs/view/solution-architect-aws-azure-at-neoris-4348226689?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/solution-architect-aws-azure-at-neoris-4348226689?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Sobre NEORIS\n\nNEORIS, ahora parte de EPAM, es un Acelerador Digital que impulsa a las compañías a entrar en el futuro, con más de 20 años de experiencia como Socios Digitales de algunas de las organizaciones más importantes del mundo. Somos más de 4,000 profesionales en 11 países, con una cultura multicultural y de mentalidad startup donde promovemos la innovación, el aprendizaje continuo y la generación de soluciones de alto impacto para nuestros clientes. Si aparece el nombre del cliente en el perfil proporcionado, no debe incluirse. Si parte del contenido está en inglés, debe permanecer en ese idioma.\n\nEstamos en búsqueda de: Solution Architect\n\nPrincipales responsabilidades\n• Diseñar arquitecturas Cloud robustas y escalables en AWS y Azure alineadas con las necesidades del negocio.\n• Liderar equipos técnicos multidisciplinarios (Cloud Engineers, DevOps) durante la implementación de soluciones.\n• Definir y supervisar la adopción de IaC (Terraform) para la automatización de infraestructuras.\n• Garantizar la integración de microservicios, contenedores y Kubernetes en entornos productivos.\n• Participar en la definición de estrategias para proyectos de Inteligencia Artificial y soluciones Agentic AI.\n• Implementar prácticas DevOps y pipelines CI/CD para lograr despliegues eficientes y confiables.\n• Diseñar e implementar soluciones de observabilidad (monitorización, trazabilidad, alertas) para asegurar la disponibilidad y rendimiento del sistema.\n• Desplegar y gestionar Landing Zones en AWS y/o Azure para entornos multi-cuenta y gobierno Cloud.\n• Evaluar y recomendar servicios IaaS, PaaS y Serverless para optimizar costos y rendimiento.\n\nRequerimientos\n\nExcluyentes\n• 5 a 8 años de experiencia en diseño e implementación de soluciones Cloud en AWS y Azure.\n• Experiencia demostrada con IaaS, PaaS, Serverless y arquitecturas distribuidas.\n• Conocimiento avanzado en microservicios, Kubernetes e IaC (Terraform).\n• Experiencia en proyectos de Inteligencia Artificial y familiaridad con Agentic AI.\n• Sólida experiencia en prácticas DevOps y herramientas CI/CD.\n• Experiencia en observabilidad (Prometheus, Grafana, ELK, OpenTelemetry o similares).\n• Experiencia en despliegue y configuración de Landing Zones en AWS y/o Azure.\n• Habilidades de liderazgo para gestionar equipos técnicos y colaborar con stakeholders.\n• Certificaciones Cloud (AWS Solutions Architect, Azure Architect o equivalentes).\n• Experiencia en entornos ágiles bajo metodologías Scrum.\n• Inglés avanzado (C1 o equivalente) para comunicación con equipos internacionales.\n• Actitud proactiva y orientada a resultados.\n\nDeseables\n• Experiencia en seguridad Cloud y compliance.\n• Familiaridad con herramientas de automatización y optimización de costos en la nube.\n\nOfrecemos\n• Contrato indefinido con salario competitivo\n• Modalidad flexible y posibilidad de trabajo remoto\n• Plan de carrera personalizado y formación continua (certificaciones, inglés, etc.)\n• Participación en proyectos estables con alto componente técnico\n• Flexibilidad horaria y enfoque en la conciliación\n• Beneficios sociales adaptados a tus necesidades\n\nTe invitamos a conocernos en http://www.neoris.com, Facebook, LinkedIn, Twitter o Instagram: @NEORIS.",
      "job_is_remote": false,
      "job_posted_at": "hace 1 día",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DyF-ppzHAyDVPQ814AAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "8-Hlv2XRdE2uS1vCAAAAAA==",
      "job_title": "AI Solutions Architect & Presales",
      "employer_name": "Realnaut",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQC_PrP1K0WLBKWSzrWxBBP0UDO0-OriBB3hjcN&s=0",
      "employer_website": "https://www.realnaut.com",
      "job_publisher": "LinkedIn",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.linkedin.com/jobs/view/ai-solutions-architect-presales-at-realnaut-4341054289?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/ai-solutions-architect-presales-at-realnaut-4341054289?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Trabajo.org",
          "apply_link": "https://es.trabajo.org/oferta-3144-1f9e7bb1a696e4f9d9fd4926f023f816?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "¿Quiénes somos?\n\nRealnaut es la marca nativa digital del Grupo Axpe Consulting, especializada en diseñar, desarrollar y operar activos digitales en Cloud. Desde su fundación en 2022, hemos colaborado con diversos clientes en más de 20 proyectos, creando experiencias únicas que impulsan el crecimiento empresarial. Nuestro equipo multidisciplinario destaca en áreas como Diseño Digital, Desarrollo, Cloud & DevOps, y Big Data, ofreciendo soluciones innovadoras y adaptadas a las necesidades específicas de cada cliente.\n\nSomos ágiles, vanguardistas, comprometid@s y techies. Nos apasiona lo que hacemos y tenemos fuertes valores de los que nos sentimos orgullosos. Con ello, buscamos a personas que compartan nuestra cultura y quieran crecer profesionalmente con nosotros.\n\n¿Qué queremos que hagas?\n• Participar en el ciclo de venta aportando expertise en IA, apoyando al equipo comercial en reuniones con clientes y elaboración de propuestas.\n• Diseñar y plantear soluciones de IA prácticas, realistas y alineadas con los objetivos del cliente.\n• Colaborar en la definición de alcances, estimaciones y planes de trabajo para proyectos de IA.\n• Liderar la implementación de soluciones de Machine Learning, NLP, RAG, automatización inteligente u otros casos de uso según la necesidad.\n• Asegurar la calidad técnica y el alineamiento con los objetivos de negocio en cada entrega.\n• Mantenerse actualizado/a en las últimas tendencias de IA generativa y aplicada, proponiendo mejoras e innovaciones a clientes y equipo interno.\n\nRequisitos:\n• Titulación universitaria en alguna carrera STEM.\n• Experiencia práctica (5+ años) en proyectos de IA aplicados a negocio.\n• Conocimiento sólido de Python y librerías de IA/ML (Scikit-learn, TensorFlow, PyTorch, LangChain u otras).\n• Experiencia en la elaboración de ofertas técnicas y documentación para clientes.\n• Habilidades de comunicación y presentación, capaz de traducir lo técnico a valor de negocio.\n• Experiencia de desarrollo y despliegue de IA en entornos cloud (AWS, Azure o GCP).\n• Mentalidad orientada a objetivos, flexible y resolutiva.\n\nSe valorará:\n• Doctorado.\n• Experiencia previa en consultoría o roles de preventa.\n• Participación en proyectos de automatización o integración de IA en procesos de negocio.\n\nTe ofrecemos:\n• Incorporación a una empresa moderna, en continuo crecimiento, donde vas a disfrutar trabajando y tendrás todas las facilidades para desarrollar tu potencial.\n• Integrarte a un equipo de profesionales altamente cualificados, con un magnífico clima laboral, innovador y dinámico que van a apoyarte para conseguir tus objetivos.\n• Participar en proyectos innovadores con tecnologías actuales.\n• Entorno de trabajo colaborativo y ágil (Scrum/Kanban).\n• Plan de formación continuo en IA, cloud y nuevas tecnologías.\n• Conciliación familiar y teletrabajo.\n• Retribución muy competitiva compuesta de: fijo, retribución flexible y seguro médico.\n\nSi piensas que cubres los requisitos no dudes en enviarnos tu CV, ¡estamos deseando conocerte!.",
      "job_is_remote": false,
      "job_posted_at": "hace 1 día",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D8-Hlv2XRdE2uS1vCAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "K_4p46QetbBtBR3YAAAAAA==",
      "job_title": "Solution Architect (F/m/d)",
      "employer_name": "Mindcurv",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/3021885235802406912?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/3021885235802406912?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "**About Mindcurv**\n\nWe help our customers rethink their digital business, experiences, and technology to navigate the new digital reality. We do this by designing sustainable and accountable solutions for humans living in a digital world. Mindcurv holistically covers the market’s need to digitize business processes and customer experiences and take advantage of the cloud following DevOps and agile principles.\n\nWithin Digital Platforms & Experiences we design and fully craft tailored solutions for our customers enabling them to get the most out of their business. We design and build a solid foundation in commerce, marketplace, responsive design, DXP and order management to name a few.\n• *Your role**\n\nYou are responsible for understanding our customer’s business strategy and play a crucial role in shaping the solution. Your responsibilities will include:\n\n- Leading discovery sessions with the client to develop a comprehensive understanding of the requirements and integrations interfaces for new commerce solutions\n- Assessing technical options for each solution in a digital commerce implementation project and evaluating possible technologies\n- Being aware of given constraints of the clients business or technology stack and consult him accordingly\n- Handling the customers expectations and showing what the possible and viable options are\n- Being a crucial part in the sales process, shaping a deal that suits the needs of the customer\n- Interacting with project and account managers for planning timelines\n- Working closely with client teams and internal colleagues across functional roles to understand requirements and make project decisions\n- Collaborate with the delivery team regularly and provide leadership and guidance to the joint Ops, Development or DevOps teams\n- Collaborating in Mindcurv internal initiatives and represent the company at relevant industry events\n• *Who you are**\n- You have experience in a similar customer-facing role within technology, preferably in the eBusiness space\n- You already worked with CMS (e.g. Bloomreach or similar)\n- You know all about the unique and special challenges of digital commerce at scale and in complex environments\nAbility to evaluate alternatives considering business needs, technology fit, cost/benefit, security and department strategies\n- If you already worked as a developer in your past this would be a plus\n- If you have experience in working in cloud technologies this is also a plus\n- You are used to switching between the English and German language while surrounded by different languages\n• *Why join Mindcurv?**\n\nWe believe that the most important aspect of a job is being excited about it, having growth opportunities and working in a team you really like. We’re always on the lookout for people who know their stuff and want to collaborate on tomorrow’s digital solutions. Our workplaces feel good, because they’re filled with good people.\n\nJoin a collaborative environment and work with the latest technologies. We’ll grow your career and provide a great workplace with flexible hours.\n\nIf you agree with our philosophy and share our values, we are looking forward to meeting you as soon as possible!",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DK_4p46QetbBtBR3YAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "paa-h6YeSyzgUzhfAAAAAA==",
      "job_title": "Solution Architect - Automotive",
      "employer_name": "SMX Services & Consulting, Inc.",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRgwGjHf329GM1njiH3mLYwIVM96ZU9-Hzwuvjf&s=0",
      "employer_website": null,
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/5516654854115688448?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/5516654854115688448?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Recruit.net",
          "apply_link": "https://www.recruit.net/job/solution-architect-automotive-jobs/3E098BDE1324FDBF?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-solution-architect-automotive-smx-services-consulting-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Estamos buscando un perfil de Solution Architect 3DEXPERIENCE con las siguientes características:\nRequisitos principales:\n+4 años experiencia y excelente conocimiento de la arquitectura de la plataforma 3DEXPERIENCE, en los ámbitos de Mechanical Design, Quality Checks, Delmia, CATIA, ENOVIA y Data Collaboration (e idealmente conocimiento de otros PLMs)\nExperiencia en Stakeholder Management, Pre-Venta y Configuration Management.\nAfinidad y conocimientos de TI.\nNivel de español C2/nativo.\nNivel de inglés C1-C2\nResidencia en Madrid preferiblemente (de no ser así, en España y con capacidad de viajar a Madrid al menos 2-3 veces al mes)",
      "job_is_remote": false,
      "job_posted_at": "hace 20 horas",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3Dpaa-h6YeSyzgUzhfAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "tGB3-Nf-KMc5FqbMAAAAAA==",
      "job_title": "Software Solution Architect (Inglés C1)",
      "employer_name": "Sopra Steria ES",
      "employer_logo": null,
      "employer_website": "https://www.soprasteria.es",
      "job_publisher": "Sopra Steria ES",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://careers.soprasteria.es/job/software-solution-architect-ingles-c1-in-madrid-spain-jid-6044?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Sopra Steria ES",
          "apply_link": "https://careers.soprasteria.es/job/software-solution-architect-ingles-c1-in-madrid-spain-jid-6044?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Indeed",
          "apply_link": "https://es.indeed.com/viewjob?jk=6a7fb355af2a159c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Sopra Steria",
          "apply_link": "https://careers.soprasteria.com/job/software-solution-architect-ingles-c1-in-madrid-spain-jid-6044?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Smart Recruiters Jobs",
          "apply_link": "https://jobs.smartrecruiters.com/SopraSteria1/744000085109565-software-solution-architect-ingles-c1-?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "SimplyHired",
          "apply_link": "https://www.simplyhired.es/job/dhpeYBd0ywCXuVKZww3telbaCtqLuwA9Tu3u6jaCpj_z3ofBy4wT3Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/software-solution-architect-ingl%C3%A9s-c1-at-sopra-steria-4308983464?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Glassdoor",
          "apply_link": "https://www.glassdoor.com/job-listing/software-solution-architect-ingl%C3%A9s-c1-sopra-steria-JV_IC2664239_KO0,37_KE38,50.htm?jl=1009893765471&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/9205712421971296256?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "Descripción de la empresa\n\nPorque trabajar en Sopra Steria, también es sentir Sopra Steria.\n\nSomos un reconocido líder europeo en consultoría, servicios digitales y desarrollo de software, con cerca de 56.000 empleados en casi 30 países y más de 4.000 en España.\n\nNos enfocamos en las personas, en su formación y desarrollo profesional, lo que nos impulsa a crecer y mejorar constantemente.\n\nTenemos pasión por lo digital y al igual que tú, buscamos la mejor de las aventuras. Queremos que tu día a día se convierta en la mejor de tus inspiraciones. Que aprendas, aportes, te diviertas, crezcas y que, sobre todo, disfrutes al máximo.\n\nSi quieres formar parte de un equipo “Great Place to Work”, ¡Sigue leyendo!\n\nDescripción del empleo\n\n¿Qué reto proponemos?\n\nEn Sopra Steria buscamos incorporar a una persona para desempeñar el rol de Arquitecto/a de Soluciones IT, principalmente enfocadas a entornos de desarrollo de software y arquitecturas de alta disponibilidad. Es para trabajar en importante cliente bancario internacional, por ello es muy importante tener un buen nivel de inglés.\n\nEl puesto es para trabajar en un modelo híbrido de teletrabajo, siendo 2 días en oficina de cliente ubicada en Madrid capital.\n\nRequisitos\n\n¿Qué buscamos?\n\nMínimo 6 años de experiencia y entre 2 y 5 años de experiencia como Solution Architect (o IT Architect)\n\nTechnical Skills:\n• Arquitecturas SOA y Microservicios\n• Arquitecturas de alta disponibilidad\n• Modelado de soluciones (UML, Archimate, Sparx EA, Visio, …)\n• Software Design Patterns\n• Mecanismos de seguridad (OpenID, Oauth2, SAML, …)\n• Patrones de integración de aplicaciones\n• Cloud Native Applications\n\nInformación adicional\n\n¿Qué tenemos para ti?\n• Contrato indefinido y jornada completa\n• 23 días de vacaciones\n• Formación continua: competencias técnicas, transversales y de idiomas. Contamos con acceso a certificaciones, formaciones de los principales Partners Tecnológicos, plataformas online y ¡mucho más!\n• Seguro de vida y de accidentes\n• Posibilidad de acogerte a nuestra retribución flexible (seguro médico, cheques guarderías, transporte, comida y formación)\n• Acceso a Privilege Club, donde encontrarás descuentos interesantes en las principales marcas\n• Onboarding personalizado y detallado. Te acompañamos en todo momento para que te sientas #soprano desde el primer momento.\n• Oficina con espacios reservados al ocio. ¡Trabajo y diversión unido!\n• Compañerismo y buen ambiente, el poder de la unión lo tenemos presente.\n\nY lo más importante…Tienes la posibilidad de desarrollar tu carrera profesional con nosotros: Crearemos juntos un plan de carrera personalizado. Te formarás, marcaremos objetivos y llevaremos a cabo un seguimiento para asegurarnos de que lo conseguimos juntos. Escuchamos tus prioridades y luchamos por ellas.\n\n¡Aquí tu voz importa! ¡Únete a nosotros y sé parte de algo más!\n\nThe world is how we shape it\n\nAdquirimos el compromiso de respetar la diversidad, creando un ambiente de trabajo inclusivo y aplicando políticas que favorezcan la inclusión y promuevan el respeto social y cultural en cuestiones de género, edad, funcional, orientación sexual y religión con igualdad de oportunidades.",
      "job_is_remote": false,
      "job_posted_at": null,
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DtGB3-Nf-KMc5FqbMAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "XdK8DJYoUh1vWUiFAAAAAA==",
      "job_title": "SAP Production Planning/Execution Solution Architect (f/m/d)",
      "employer_name": "Hitachi Careers",
      "employer_logo": null,
      "employer_website": "https://careers.hitachi.com",
      "job_publisher": "Hitachi Careers",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://careers.hitachi.com/jobs/17064944-sap-production-planning-slash-execution-solution-architect-f-slash-m-slash-d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Hitachi Careers",
          "apply_link": "https://careers.hitachi.com/jobs/17064944-sap-production-planning-slash-execution-solution-architect-f-slash-m-slash-d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Hitachi Energy",
          "apply_link": "https://www.hitachienergy.com/ch/it/careers/open-jobs/details/JID3-167814?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/sap-production-planning-execution-solution-architect-f-m-d-at-hitachi-energy-4325028863?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Indeed",
          "apply_link": "https://es.indeed.com/viewjob?jk=63aa89ca3c9a67a7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Glassdoor",
          "apply_link": "https://www.glassdoor.com/job-listing/sap-production-planning-execution-solution-architect-f-m-d-hitachi-JV_IC2664239_KO0,58_KE59,66.htm?jl=1009955528755&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "SimplyHired",
          "apply_link": "https://www.simplyhired.es/job/hTRIa3QVoKmVPr0laGilvazWuGoAFqbCfDw2YROBEWYibgJZmVpmdg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Glassdoor",
          "apply_link": "https://www.glassdoor.es/job-listing/sap-production-planning-execution-solution-architect-f-m-d-hitachi-JV_IC2664239_KO0,58_KE59,66.htm?jl=1009955528755&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Notify",
          "apply_link": "https://notify.careers/postings/17dbec9d-892d-499b-ab66-453db9c036f6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Description\n\nThe opportunity\n\nWe are seeking a highly skilled and strategic Solution Architect to lead the design and delivery of SAP solutions and integrated applications that support our business objectives. In this key role, you will be responsible for ensuring the architectural integrity, functionality, and quality of the solutions provided, aligning them closely with business requirements and long-term goals. You will collaborate across teams to support project initiation, execution, and continuous service improvement, while managing interdependencies within and beyond your designated end-to-end stream. This is an excellent opportunity to influence enterprise-wide transformation through innovative and reliable technology solutions.\n\nHow you will make an impact\n• Collaborate with project owners, business units, functional consultants, and external partners to validate and prioritize incoming business demands\n• Translate functional designs into comprehensive functional and technical specifications, ensuring alignment and sign-off on use cases\n• Effectively communicate technical specifications to development teams and support unit testing, UAT, and defect resolution\n• Define and apply architectural principles, guidelines, and non-functional requirements to ensure scalable and reliable solutions\n• Stay informed on emerging technologies and industry best practices, contributing insights to the SAP Center of Excellence\n• Work closely with users and cross-functional teams to deliver cost-efficient, user-centric SAP solutions and services\n• Ensure solution documentation and training materials are created, maintained, and aligned with implementation needs\n• Support the installation, maintenance, and optimization of SAP processes, while providing functional guidance to technical teams\n\nYour background\n• Bachelor’s or Master’s degree in Computer Science, Engineering, or a related discipline\n• 10+ years of experience in IT, including 8+ years in solution architecture with a strong focus on S/4HANA systems and 5+ years in global project delivery\n• Proven leadership experience managing cross-functional teams (onshore/offshore) of up to 20 members across functional and ABAP domains\n• Hands-on experience with integration tools such as BizTalk and/or MuleSoft; SAP ABAP and ALE-IDOC knowledge is a plus\n• Certified in S/4HANA or other SAP solutions, with a strong track record of implementing SAP best practices in complex environments\n• Strong ability to translate business requirements into effective IT solutions, with a focus on innovation, decision-making, and stakeholder communication\n• Fluent in English, with international work experience and a deep understanding of SAP’s evolving technology landscape\n\nMore about us\n• You will do interesting and enriching work, as part of the global Hitachi Energy SAP Center of Expertise team\n• You will be stretched, encouraged, and supported to grow – we pride ourselves on providing strong learning and development opportunities\n• We offer an environment that fosters collaboration, connection, and diversity of thought\n• Our culture is one of a kind: Come as you are and bring your unique attributes, passion, and drive to Hitachi Energy, contributing to making us ‘the place to be’ and to our purpose of advancing a sustainable energy future for all\n• Flexible working, including hybrid/remote working opportunities\n• A competitive compensation and benefits package\n\nQualified individuals with a disability may request a reasonable accommodation if you are unable or limited in your ability to use or access the Hitachi Energy career site as a result of your disability. You may request reasonable accommodations by completing a general inquiry form on our website. Please include your contact information and specific details about your required accommodation to support you during the job application process.\n\nThis is solely for job seekers with disabilities requiring accessibility assistance or an accommodation in the job application process. Messages left for other purposes will not receive a response.",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DXdK8DJYoUh1vWUiFAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "iCMrNiiHd0eXsqhVAAAAAA==",
      "job_title": "Security Solution Architect",
      "employer_name": "Avanade",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS7_BZTVTGnnkOaRksO6ZyD2VVegsB6acbTVXht&s=0",
      "employer_website": "https://www.avanade.com",
      "job_publisher": "LinkedIn",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.linkedin.com/jobs/view/security-solution-architect-at-avanade-4341013801?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/security-solution-architect-at-avanade-4341013801?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/1740010533588828160?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "BeBee",
          "apply_link": "https://es.bebee.com/job/289c6f41b98784681d4b421af01cf694?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "A Security Solution Architect designs and builds Solution deal shapes including development of key solution plan documentation such as cost estimates, staffing plans, delivery location strategies, technical blueprints and implementation roadmaps. Additionally, this role listens deeply and seeks to understand the client context before solutioning; relentlessly focuses on client needs, iterating with the client and/or sales team to uncover and maximize value for both Client & Avanade; and brings deep expertise in Microsoft security technologies to the solution; uses storytelling and real-world examples to effectively articulate the solution vision throughout the deal lifecycle. Key Responsibilities: Design & build solution plan: understand and translate client requirements; assess relevant service/offering/capability which will address client requirements and deliver value and collaborate with other Solution Architects and SMEs as required to define the solution. Designs and builds Solution deal shapes including development of key solution plan documentation such as cost estimates, staffing plans, delivery location strategies, technical blueprints and implementation roadmaps. Costing pricing and deal shaping: complete costing and/or pricing. Use standard solution architecture processes, methods and estimating, and modelling tools to drive quality and to minimize time to solution through process and reuse. Identify potential risks and partner with senior leadership to mitigate. Ensure that the contract preserves the solution architecture design. Support Profitable Sales: engage in early conversations with the client and support origination/deal qualification efforts. Prepare for and play a trusted advisor role. Support the sales pursuit team in commercial shaping and negotiation of contract terms and conditions, assumptions and dependencies. Collaborate with Delivery team to enable and effective and conscientious transition of solution during mobilization and stabilization or delivery phases and dependencies.",
      "job_is_remote": false,
      "job_posted_at": "hace 1 día",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DiCMrNiiHd0eXsqhVAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15112200",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "zLw2HX1U1c9XNbVLAAAAAA==",
      "job_title": "Solution Architect, Retail Planning",
      "employer_name": "CENTRIC SOFTWARE INC",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHBfOAIQrxKFOhL6oJWl_wsgXKxeOpkUM5Mgv5&s=0",
      "employer_website": null,
      "job_publisher": "Indeed",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.indeed.com/viewjob?jk=b22c01aa867d4e5a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Indeed",
          "apply_link": "https://es.indeed.com/viewjob?jk=b22c01aa867d4e5a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/solution-architect-retail-planning-at-centric-software-4333411235?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "SimplyHired",
          "apply_link": "https://www.simplyhired.es/job/viw1uJSXWrINjO0OCYGoM5aMRdTLRmyX4IXAwvPvz1Ukx7rPT32cwg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "JobTarget",
          "apply_link": "https://www.jobtarget.com/jobs/jt-t7zexnviy3/solution-architect-retail-planning-madrid-madrid-comunidad-de?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "BeBee",
          "apply_link": "https://es.bebee.com/job/f1ddcd0336ee885d90032bfb410a329b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jooble",
          "apply_link": "https://es.jooble.org/jdp/4968984878408723032?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "CENTRIC SOFTWARE INC - JazzHR",
          "apply_link": "https://20191015162358_d5yjmsehfmecy6sq.applytojob.com/apply/TGAgyJo2K7/Solution-Architect-Retail-Planning?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Glassdoor",
          "apply_link": "https://www.glassdoor.com/job-listing/solution-architect-retail-planning-centric-software-JV_IC2664239_KO0,34_KE35,51.htm?jl=1009924627415&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "Centric Software is looking for a Senior Solution Architect to join our growing planning team in Europe. The successful candidate should provide solution and technical skills in a fast-moving environment. You will need to be a leader, quick thinking and driven to provide planning solutions that deliver value to our clients. You will be working directly with our clients, internal and external partners to lead the technical design and configuration requirements to provide best practice planning architecture.\n\nAbout the Team\n\nThe Centric planning team are leading the market in the delivery of first-class planning solutions for the fashion and retail industries. A dynamic and driven team of technical and business experts delivering end-to-end planning systems and driving customer project success. The teams are all home based in different countries around the World. The role reports into the Client Services Director.\n\nResponsibilities\n• Define and optimize design solutions in line with clients’ requirements leveraging the Centric Planning platform\n• Work closely with Centric solution delivery teams and customers clients\n• Collect, understand, challenge and communicate the business requirements for the project, translating these into functional specifications\n• Define the configuration and data requirements to meet the required business processes.\n• Assist in the preparation system test and validation plans\n\nSkills\n• Scientific or technical degree in Engineering or Computer Science\n• Excellent technical, verbal and written communication skills\n• Basic knowledge on database queries (MS SQL Server)\n• Knowledge of Planning applications at a strategic and operational level\n• Track record in consultancy within the IT / Merchandising / Supply Chain planning\n• Experience in Planning Management systems and tools implementation\n• Previous business and implementation experience\n• Strong Spanish speaking skills\n\nPlus\n• Advanced knowledge on database queries (MS Sql Server)\n• Knowledge of data science\n• Power BI knowledge (Dataset modelling and Dashboard design)\n\nCentric Software provides equal employment opportunities to all qualified applicants without regard to race, sex, sexual orientation, gender identity, national origin, color, age, religion, protected veteran or disability status or genetic information.\n\nTGAgyJo2K7",
      "job_is_remote": false,
      "job_posted_at": null,
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DzLw2HX1U1c9XNbVLAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "qspAbuRAyq4TV4maAAAAAA==",
      "job_title": "Aws Solutions Architect, Csc, Csc Sa Emea",
      "employer_name": "AWS EMEA SARL (Spain Branch)",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/6825398321977229312?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/6825398321977229312?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "Experience creating and leading business plans on technical teams\n- Experience in development or network administration or DevOps or technical consulting\n- Working knowledge of cloud technologies\n- Working knowledge of software development tools and methodologies\n- Experience presenting to both large and small audiences\n- Experience communicating across internal and external organizations\n\nJob summary\n\nDo you have broad skills in software development or networking or system administration? Are you passionate about cloud computing and teaching others how to benefit from and use cloud technologies and solve business and technical problems? Are you willing to help SA team to scale and grow understanding the business needs of CSC?\n\nThe CSC Solution Architect presents opportunities for the right individual to help customers innovate on AWS and shape customer solutions by empowering Central Sales teams with technical skills and to have effective engagement and meetings with customers. The CSC SA's will also educate customers on how to craft highly scalable, flexible, resilient, secure and cost-effective cloud architectures with the knowledge and understanding of the resources and processes available to achieve operational excellence. You will have the equally exciting opportunity to grow the business impact of the SA team helping us to scale and grow at the speed that CSC Organization needs.\n\nThis role requires travel up to 10%.\n\nRoles & Responsibilities:\n\n- Partner with CSC leadership to design a flexible, strong and scalable SA team\n- Partner with the CSC team to educate customers on the value proposition of AWS, and participate in architectural discussions to ensure solutions are designed for successful deployment in the cloud\n- Own each engagement, helping to work towards a timely and successful delivery of customer outcomes and solutions\n- Capture and share best-practice knowledge within the AWS solutions architect community\n- Create and deliver training and education sessions to widen and deepen technical and process skills for the Demand Generation team\n- Author or otherwise contribute to AWS customer-facing publications such as whitepapers\n- Act as a technical liaison between customers and product teams and help evolve the AWS platform\n- Experience working within software development or Internet-related industries\n- AWS Certification, eg. AWS Solutions Architect Associate\n- Solution selling experience\n- Experience in process improvement at org level\n- Project or Program management experience\n- Knowledge of other European Languages\n\naws-solarch-ea",
      "job_is_remote": false,
      "job_posted_at": "hace 20 horas",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DqspAbuRAyq4TV4maAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "YVgDZJVUzzuq2T7RAAAAAA==",
      "job_title": "Solutions Architect/ Spain",
      "employer_name": "Cloudera",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTc_P03oG9eNi_ctRxfJ79Htf9uB1c8nLQ6mT2t&s=0",
      "employer_website": "https://www.cloudera.com",
      "job_publisher": "GrabJobs",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://grabjobs.co/spain/job/full-time/others/solutions-architect-spain-150811531?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "GrabJobs",
          "apply_link": "https://grabjobs.co/spain/job/full-time/others/solutions-architect-spain-150811531?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Business Area:\nProfessional Services\n\nSeniority Level:\nMid-Senior level\n\nJob Description:\n\nDescription\n\nWe (Professional Services team) are looking for an exceptional person with strong technical and client consulting experience.\n\nA Day in the Life\n\nYou as a Solutions Architect will not act as a typical consultant - you will function as team manager and can expect to work with some of EMEA's most exciting private and public sector organisations. Our customer engagements range from simple deployments of our Hadoop based Enterprise Data Hub, CDH, to large scale analytics use case design and deployment.\n\nYou have...\n• working knowledge of setting up and running Hadoop clusters\n• knowledge on how to create and debug Hadoop jobs\n• consulting background and/or comfort in working with customers\n• demonstrated experience gathering and understanding customer\n\nbusiness requirements\n• familiarity with data warehousing concepts\n• knowledge of distributed systems, complex data pipeline, ETL and\n\ncommon ETL packages / libraries\n• understanding of configuration management systems (e.g. Puppet,\n\nChef) and concepts behind mass configuration\n• 75% travel required\n• to be eligible to work in the EU\n\nYou might also have...\n• high availability and business continuity\n• proficiency in a second European language as a plus\n\nExperience with most of the following:\n• One or more of Oracle, MySQL, PostgreSQL\n• Concurrency and synchronisation\n• Fallacies of distributed computing\n• Common IPC/RPC methods and patterns\n• Queuing patterns and pipeline design\n• Batch operations\n• Messaging systems and patterns\n• Solid OS / networking fundamentals\n• Virtual memory management\n• File system design\n• Optimization and troubleshooting\n• System administration knowledge\n• L2 vs. L3 networking, network architecture, VLANs, hardware device design basics\n\nWhat you can expect from us:\n• Generous PTO Policy\n• Support work life balance with Unplugged Days\n• Flexible WFH Policy\n• Mental & Physical Wellness programs\n• Phone and Internet Reimbursement program\n• Access to Continued Career Development\n• Comprehensive Benefits and Competitive Packages\n• Paid Volunteer Time\n• Employee Resource Groups\n\nEEO/VEVRAA\n\nOriginal job Solutions Architect/ Spain posted on GrabJobs ©. To flag any issues with this job please use the Report Job button on GrabJobs.",
      "job_is_remote": false,
      "job_posted_at": "hace 5 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DYVgDZJVUzzuq2T7RAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "9xyv9dDPplQMyb4-AAAAAA==",
      "job_title": "IT Solutions Architect (Full Remote)",
      "employer_name": "Grupo Digital",
      "employer_logo": null,
      "employer_website": "https://grupodigital.eu",
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/1246569781130166272?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/1246569781130166272?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "**Descripción**:\nFrom Grupo Digital, we are looking for a IT Solutions Arquitect\n\nProject Duration: Stable\n\nWork mode: Full remote.\n\nLocation: Madrid.\n• *Residence and work permit in Spain is mandatory.**\n• *Responsibilities**:\n\n- Production of a Solution Design Document\n- Production and maintenance of the Service Domain document which details core/system and BaaS APIs in a specific BIAN Service Domain\n- Sequence Diagrams for functional flows\n- Review the As Is documentation\n- Review requirements in the form of user stories, sprint reviews and DDPs\n- Application interaction diagrams\n- Work with respective domain EAs to ensure pattern and strategy alignment of solutions\n- Work with API designers to ensure the capabilities of APIs align to group\n- Completes Architecture Solution Approval\n• *Requisitos**:\n• *Mandatory skills**:\n\n- 3+ experiencie years\n- A deep knowledge of the BIAN framework and service domains specific to the domain speciality. Working knowledge of those it interacts with to shape and define the service domain capability within Santander.\n\nAPI definitions\n\nsystem services, xAPI, BaaS and omni channel and the functions/business capabilities covered by each.\n\nSupports Architecture governance\n\nAPI Governance process\n\nQA of APIs being developed in accordance with SA design\n\nFunctional consultancy and knowledge sharing with peers to ensure awareness and alignment of design patterns\n- High level of English.\n• *Grupo Digital",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D9xyv9dDPplQMyb4-AAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "o5QAF9yKcz9j7oPSAAAAAA==",
      "job_title": "It Solutions Architect (Madrid)",
      "employer_name": "*Nombre Oculto*",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jobijoba",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobijoba.es/oferta-empleo/69/6fcf4c61e4ffe533a2bb80275eae3456?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobijoba",
          "apply_link": "https://www.jobijoba.es/oferta-empleo/69/6fcf4c61e4ffe533a2bb80275eae3456?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/532016346972553216?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Trabajo.org",
          "apply_link": "https://es.trabajo.org/oferta-3393-b6322907e07b32e7e5a6d94c42fbc855?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-it-solutions-architect-bebeearchitecture-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Overview Pre-Sales Solutions Architect Location: Madrid UK (Hybrid - 2 days in the office) Language: English required We're looking for an experienced Pre-Sales Solutions Architect to help strengthen our client's presence in a key market. Working hand-in-hand with AWS and their commercial teams, you'll act as the bridge between technology and business, supporting sales to achieve ambitious targets and delivering the technical expertise that underpins customer success. This role offers a blend of strategic influence and hands-on engagement, giving you the chance to shape client conversations, create compelling solutions, and represent AWS services with credibility and impact. Responsibilities Lead technical discovery sessions and qualify opportunities for AWS-based solutions. Translate complex business requirements into secure, scalable, and cost-effective AWS architectures. Design solutions aligned with AWS best practices, including the Well-Architected Framework, Control Tower, and Security Hub. Conduct AWS MAP assessments and support migration funding business cases. Collaborate with AWS and internal teams to drive sales success and customer outcomes. Qualifications Experience as a Pre-Sales Solutions Architect or similar role in cloud-based solutions. Strong ability to translate business requirements into technical architectures on AWS. Familiarity with AWS Well-Architected Framework, Control Tower, Security Hub, and migration assessments is a plus. #J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 7 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3Do5QAF9yKcz9j7oPSAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "4hS3leXl8SNh4YrrAAAAAA==",
      "job_title": "Solution Architect Cloud Applications and",
      "employer_name": "TK ELEVATOR IBERICA HOLDING, SL UNIPERSONAL",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/4914751677623435264?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/4914751677623435264?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Trabajo.org",
          "apply_link": "https://es.trabajo.org/oferta-3393-3db07d47cd3e3bb5d8ff84d8a081bbd4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-cloud-architect-software-developer-bebeearquitecto-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "La empresa\nTK Home Solutions is one of the leading global providers of mobility solutions for the private and public sectors and part of the TK Elevator Group. Our product portfolio includes platform, residential and stair lifts. Worldwide, more than 900 employees contribute to the success of TK Home Solutions with development, production, sales and service of our products. We improve people´s lives.\n• *Qué esperamos**:\n\n- You manage projects in this area and steer and monitor external vendors\n- You ensure smooth transition of projects into operations and set up SLA based services using internal and external partners\n- You plan for security, performance, uptime, disaster recovery, and capacity growth\n- You partner with the business and consult on cloud and interface related topics\n• *A quién buscamos**:\n\n- Degree in IT, Business IT or comparable technical education\n- Several years of experience as Software Architect and Project Manager\n- Deep understanding of architecture and all aspects of the software development life cycle using cloud technologies\n- Strong knowledge of interfacing and integration technologies to connect cloud and on-premise solutions\n- Hands-on experience in SAP PI/PO, Microsoft Azure and REST API’s\n- Good understanding of general database concepts and technology\n- Experience in agile project management methodologies\n- High level of spoken and written English; any other additional language is an advantage\n- Analytical and conceptual thinker with high focus on solutions\n- Willingness to travel\n• *Qué ofrecemos**:\n\n- Secure job and salary - permanent contract in a technically exciting, stable, and sustainable industry and an attractive compensation package\n- Social benefits including flexible pay scheme and lunch tickets\n- Teamwork & safety - an open, transparent, and value-oriented culture\n- Individualized training plan from your very first day.\n- TK Elevator is a company with an open, transparent culture that focuses on the people who make it up. At TKE you will receive frequent feedback, continuous training and space to contribute your ideas.\n• *Contacto**:",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D4hS3leXl8SNh4YrrAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "lUlQCqkMcK4pJYRpAAAAAA==",
      "job_title": "Senior Solution Architect AI and Cloud, Madrid (M, ES)",
      "employer_name": "Swiss Re",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTcLeG6SwDU52hKF8d6e7JqIDyCvUo5jeCSA5p5&s=0",
      "employer_website": "https://www.swissre.com",
      "job_publisher": "Indeed",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.indeed.com/viewjob?jk=0f0fb39954a02075&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Indeed",
          "apply_link": "https://es.indeed.com/viewjob?jk=0f0fb39954a02075&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "SimplyHired",
          "apply_link": "https://www.simplyhired.es/job/QYqsofO-QVqPX59MtIXjo3Izc9DzbTpb8Yt0cSYDCHOXFV5hc9tLGg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Location: Madrid, M, ES\n\nAbout the Team and our Scope\n\nOur team, a software house within Swiss Re, develops cloud-native (Azure-based) SaaS/PaaS solutions for external Life & Health insurance clients. Our portfolio includes established products like Magnum and those in growth or incubation stages, used globally. We utilize the latest technology and prioritize innovation to stay competitive.\n\nOur technical team comprises over 150 professionals with multidisciplinary skills, located in various countries, delivering highly available, multi-regional solutions used worldwide.\n\nAbout the Role\n\nWe seek a Senior Solution Architect to lead our Data Analytics and AI initiatives. Our Data & Analytics service is a cloud-native SaaS leveraging Azure Data Factory, Databricks, Synapse, modern data lake house infrastructure, and relational databases. In AI, we develop a GenAI-powered backend integrating with client products to deliver features such as RAG, OCR/NLP, and more using LLMs.\n\nAs a Senior Solution Architect, you'll guide platform design to ensure scalable, secure, and cost-effective solutions. The role blends strategic planning with practical implementation, involving hands-on work with code and infrastructure. You will join the technical leadership team, collaborating with Product Owners and Engineering Managers to shape the tech roadmap and drive team direction.\n\nYour responsibilities will be:\n• Architecture: Design efficient cloud-native SW systems with self-healing reliability mechanisms\n• Tech Leadership: Create technical documentation, write specifications, and guide implementation\n• Team Growth: Mentor teams, foster engineering excellence, and drive innovation\n• Hands-on: contribute and lead implementation, analysis, troubleshooting, evolutive maintenance, delivery and experimentation of PoC with new technologies\n• Strategy: Present roadmaps to stakeholders while exploring emerging technologies\n\nAbout You\n\nNobody is perfect and meets 100% of requirements. If you, however, meet some of the criteria below and are genuinely curious about the world of software development and IT Cloud, we will be happy to meet you.\n\nIf you possess traits and experience that match most of the below, we’d love to hear from you:\n\nMust have excellent technical proficiency in:\n• Cloud Expertise: Experience designing enterprise grade multi-tenant SaaS products on Azure combining application and infrastructure services (AKS, Networking, CDN, WAF, etc.)\n• System Design: Proven technical architecture experience with Java, Spring MVC, and distributed systems\n• Security Knowledge: Zero Trust implementation, authentication protocols, and network security\n• Integration Skills: Experience with service integrations (REST, SOAP) and event-driven architecture\n• Infra and DevSecOps: Experience with DevSecOps practices: CI/CD, IaaS, and everything related to release a self-healing, high reliability, cloud infrastructure\n• Technical Analysis: Proficiency in architecture modeling and documentation\n• Tech team leadership: Experience in coaching and guiding multi-cultural technical team members\n\nPreferable knowledge also about:\n• Quality and vulnerability (e.g., SonarQube, Invicti, Aqua)\n• Programming background with any OOP languages (e.g., Java, .Net) preferably with GOlang\n• Hands-on experience with Maven and/or Gradle\n\nFor Spain the base salary range for this position is between [EUR 60.000] and [EUR100.000] (for a full-time role). The specific salary offered considers:\n• the requirements, scope, complexity and responsibilities of the role,\n• the applicant's own profile including education/qualifications, expertise, specialization, skills and experience.\n\nIn addition to your base salary, Swiss Re offers an attractive performance-based variable compensation component, designed to recognize your achievements. Further you will enjoy a variety of global and location specific benefits.\n\nEligibility may vary depending on the terms of Swiss Re policies and your employment contract.\n\nAbout Swiss Re\n\nSwiss Re is one of the world’s leading providers of reinsurance, insurance and other forms of insurance-based risk transfer, working to make the world more resilient. We anticipate and manage a wide variety of risks, from natural catastrophes and climate change to cybercrime. Combining experience with creative thinking and cutting-edge expertise, we create new opportunities and solutions for our clients. This is possible thanks to the collaboration of more than 14,000 employees across the world.\n\nOur success depends on our ability to build an inclusive culture encouraging fresh perspectives and innovative thinking. We embrace a workplace where everyone has equal opportunities to thrive and develop professionally regardless of their age, gender, race, ethnicity, gender identity and/or expression, sexual orientation, physical or mental ability, skillset, thought or other characteristics. In our inclusive and flexible environment everyone can bring their authentic selves to work and their passion for sustainability.\n\nIf you are an experienced professional returning to the workforce after a career break, we encourage you to apply for open positions that match your skills and experience.\n\nKeywords:\nReference Code: 134778",
      "job_is_remote": false,
      "job_posted_at": null,
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DlUlQCqkMcK4pJYRpAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "k0UrtOOFW9lKu1BtAAAAAA==",
      "job_title": "Solutions Architect - 100 % remota",
      "employer_name": "SOTEC CONSULTING",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEBdzbRe5pxj7oR1kWNrQI_zHUxsPGvj_7d0ZM&s=0",
      "employer_website": null,
      "job_publisher": "LinkedIn",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.linkedin.com/jobs/view/solutions-architect-100-%25-remota-at-sotec-consulting-4347374613?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/solutions-architect-100-%25-remota-at-sotec-consulting-4347374613?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "¿Qué ofrecemos?\n\nDesde SOTEC Consulting – Grupo Astek buscamos un/a Solutions Architect para incorporarse a un proyecto estable dentro del sector bancario 100% remoto.\n• Proyecto estable y de larga duración en cliente del sector bancario.\n• Modalidad 100 % remota.\n• Contrato indefinido.\n• Formación continua.\n\n¿Qué buscamos?\n• Experiencia sólida (5 años) en arquitectura de soluciones, preferiblemente dentro de entornos bancarios o financieros.\n• Experiencia en alguna de las plataformas cloud (AWS, Azure o Google Cloud Platform).\n• Conocimientos en prácticas DevOps, CI/CD, automatización y orquestación de despliegues.\n• Experiencia con bases de datos SQL y NoSQL.\n• Manejo de herramientas de modelado y diagramación (Lucidchart, Archimate, UML…).\n• NIVEL MEDIO de INGLÉS (documentación y reuniones técnicas).\n\nSotec Consulting son personas y la base sobre la que construir.\n\nApostamos por la integración de las personas dentro de nuestro selecto grupo, buscando el talento y la excelencia profesional, ofreciendo las mejores oportunidades laborales, nacionales e internacionales, para todos nuestros candidatos. Trabajarás junto a los más capacitados profesionales. Buscamos personas con un talento especial, para poder ayudarles a desarrollar dicho talento dentro de nuestra compañía. porque para Sotec, las personas son la base sobre la que construir. Sotec es más que un trabajo, Sotec es un grupo unido, luchando por un mismo fin. Let's do the right thing! En Sotec Consulting tendrás una carrera adaptada a tus necesidades, conseguirás un amplio progreso ya que trabajarás directamente con grandes profesionales del sector. El Programa TELÉMACO consiste en formar a las personas en todos los aspectos para que, de forma proactiva, sean capaces de enfrentarse a situaciones reales, dejando un importante legado a quienes vengan detrás. Compromiso con la Igualdad Sotec es una compañía comprometida con la igualdad de oportunidades, sin tener en cuenta raza, sexo, religión, edad, orientación sexual, estado civil, discapacidad, nacionalidad o identidad de género. Nos sentimos orgullosos de esforzarnos cada día en evitar los sesgos de cualquier tipo.",
      "job_is_remote": false,
      "job_posted_at": "hace 9 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3Dk0UrtOOFW9lKu1BtAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "gM0iZNECFDiDTc2OAAAAAA==",
      "job_title": "Remote Senior Solution Architect - AI, Cloud & Microservices",
      "employer_name": "Scalian",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNAUPBYlzOnPdP98Dp2albI7FwuPJ43FNEfnNP&s=0",
      "employer_website": "https://www.scalian.com",
      "job_publisher": "Jooble",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jooble.org/jdp/-7625023999093007805?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jooble",
          "apply_link": "https://es.jooble.org/jdp/-7625023999093007805?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Expertini",
          "apply_link": "https://madrid.es.expertini.com/job/senior-solution-architect-wms-madrid-blue-yonder-b87298066f74/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-senior-solution-architect-informationsmanagement-lebenszyklus?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Una empresa internacional de tecnología busca un experto en arquitectura de sistemas para liderar la implementación de soluciones IAG. Con 5-10 años de experiencia en microservicios y un sólido conocimiento en Java y Python, tendrás la oportunidad de trabajar en un entorno innovador con tecnologías punteras. Ofrecemos teletrabajo, 25 días de vacaciones, formación continua y un contrato indefinido. Si te apasiona el diseño técnico y la colaboración, esta es tu oportunidad.\n#J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 2 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DgM0iZNECFDiDTc2OAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "GdPlaisZr1Au5npMAAAAAA==",
      "job_title": "Cloud Solution Architect - Remote (Madrid)",
      "employer_name": "ECM Talent",
      "employer_logo": null,
      "employer_website": "https://www.ecm-talent.com",
      "job_publisher": "Jobijoba",
      "job_employment_type": "Contratista",
      "job_employment_types": [
        "CONTRACTOR"
      ],
      "job_apply_link": "https://www.jobijoba.es/oferta-empleo/69/5dbcdc26bd27da270a4b979551727539?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobijoba",
          "apply_link": "https://www.jobijoba.es/oferta-empleo/69/5dbcdc26bd27da270a4b979551727539?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/7788904759443849216?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Kit Empleo",
          "apply_link": "https://www.kitempleo.es/empleo/297314291/solution-architect-cloud-madrid?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-cloud-solution-architect-m-f-d-zoi-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Direct message the job poster from ECM Talent\n\nAn excellent opportunity for a Cloud Solution Architect to join a leading client in Europe on a minimum 12 month contract with opportunity to extend longer term. Remote working from anywhere in Europe. Candidate must be eligible to work in the EU, No sponsorship provided.\n\nYou’ll lead architecture and design for large-scale, cloud-based platforms – covering .NET Core APIs, automation, data architecture, and cloud security. This is a hands‑on technical role where you’ll be working across modern Azure environments and collaborating with senior engineering teams.\n\nKey Skills & Experience\n\n5+ years as a Cloud Solution Architect\n\n3+ years in API architecture – Microservices, Service Bus, App Services, Kubernetes, SQL, NoSQL, Azure Cloud\n\n3+ years in API development using .NET Core 2.X+\n\n3+ years in DevSecOps & cloud infrastructure (Azure DevOps, CI/CD, Security, Automation, Platform Engineering)\n\n3+ years in Data Architecture\n\n(Optional) Angular / Typescript & Site Reliability Engineering experience\n\nSeniority level\n\nMid‑Senior level\n\nEmployment type\n\nContract\n\nJob function\n\nInformation Technology\n\nIT Services and IT Consulting\n\n#J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 8 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DGdPlaisZr1Au5npMAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "a0n52Ncig9mEMjhYAAAAAA==",
      "job_title": "Cloud-Native Solution Architect — Microservices Leader",
      "employer_name": "Nagarro",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRHCdvtL3wXgcHe-WACHwnSYtYAk2BbFDeHF-ap&s=0",
      "employer_website": "https://www.nagarro.com",
      "job_publisher": "Recruit.net",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.recruit.net/job/cloud-native-solution-architect-microservices-jobs/697F6A630F04E160?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Recruit.net",
          "apply_link": "https://www.recruit.net/job/cloud-native-solution-architect-microservices-jobs/697F6A630F04E160?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "A leading technology firm based in Madrid is seeking an experienced Solution Architect to lead the design and execution of secure and scalable cloud-native systems. Responsibilities include overseeing architectural design, collaborating with stakeholders, and mentoring technical teams. Ideal candidates have 10 years of software development experience with strong knowledge in microservices and cloud deployments, particularly in the BFSI sector. The role offers a hybrid work model, requiring two days at the office each week. J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 4 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Comunidad de Madrid",
      "job_city": null,
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.416708799999995,
      "job_longitude": -3.5812692,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3Da0n52Ncig9mEMjhYAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "Mn_jQAhN4SmwWWBIAAAAAA==",
      "job_title": "Solutions Architect - Public Sector - Spain",
      "employer_name": "AWS EMEA SARL (Spain Branch)",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/3058894247437533184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/3058894247437533184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "Background in any of the following: Cloud Architecture, Systems Design, Software Development, Infrastructure Architecture, Data Engineering or DevOps.\n- Have a demonstrated ability to think strategically about business, product, and technical solutions.\n- Excellent verbal and written communication skills, with business-fluent English and Spanish, to be able to drive discussions in a customer organisation, as well as the technical background that enables you to easily interact with and give guidance to customers working in operational roles.\n- A passion for technology and for learning.\n\nJob summary\n\nAs an AWS Solutions Architect, you will have ownership of the technical relationship with customers, making recommendations on security, cost, performance, reliability, operational efficiency and best-practice architectures.\n\nInternally, you will be an advocate acting on behalf of the customer to help drive continual improvements to the AWS platform, sharing their needs and wants to inform the roadmap of AWS features and services. You will also help shape the future of the Solutions Architecture organisation by helping to hire, coach and mentor others.\n\nIn this role, your creativity will link technology to tangible solutions, with the opportunity to define cloud-native reference architectures with the worldwide AWS Solutions Architect community.\nYou will participate in the creation and sharing of best practices, technical content and new reference architectures (e.g. white papers, code samples, blog posts) and evangelise and educate about AWS technology (e.g. through workshops, user groups, meetups, public speaking, online videos or conferences).\n\nIf you can educate AWS customers about the art of the possible, while investigating the impossible, come build the future with us.\n- Experience designing, building, refactoring or operating large scale and impactful IT systems - either on premises or in the cloud.\n- Working knowledge of cloud native architectures.\n- Experience working in a customer-facing role.\n- AWS certification (e.g. AWS Solutions Architect Associate or Professional) or other industry certification",
      "job_is_remote": false,
      "job_posted_at": "hace 3 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DMn_jQAhN4SmwWWBIAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "5M69rRsgOPO5b8klAAAAAA==",
      "job_title": "Solutions Architect (Javascript / Typescript)",
      "employer_name": "Dimática",
      "employer_logo": null,
      "employer_website": "https://www.dimaticasoftware.com",
      "job_publisher": "JobLeads",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobleads.com/es/job/solutions-architect-javascript-typescript--madrid--e6784356ea2ee8a4a84592dfedff869e8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "JobLeads",
          "apply_link": "https://www.jobleads.com/es/job/solutions-architect-javascript-typescript--madrid--e6784356ea2ee8a4a84592dfedff869e8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/5083292997546672128?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Talent.com",
          "apply_link": "https://es.talent.com/view?id=eba062496be7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Spain Jobs Expertini",
          "apply_link": "https://es.expertini.com/job/solutions-architect-javascript-typescript-madrid-dimatica-1961-108175807/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "This opportunity is only for residents in Spain\n\nAt DIMÁTICA, a company recognised as a Microsoft PARTNER, we specialise in software design, development and maintenance solutions in multiplatform environments.\n\nWe carry out R&D&I projects, considering them a key element for our competitiveness. Dimática's trajectory in software development would not be complete without these projects, each serving as a key point for the company's growth.\n\nWe are currently looking for someone with experience in UI design and web layout to join our Innovation Center team, working in collaboration with teams in Sydney, Germany, the USA, and Hong Kong.\n\nResponsibilities\n\nTogether with business analysts, identify, scope, consult on and manage customer business needs and expectations.\n\nCreate and explain designs for architecture, domains and relational databases.\n\nGuide team members in the transformation of business requirements into documented processes and eventually into implemented code.\n\nOversee the transfer of developed software products into the operations phase.\n\nParticipate in hiring, team setup, team onboarding and supervision activities.\n\nEstablish and evangelize ways of working.\n\nAssist in evaluating, establishing and enforcing architectural patterns, technical tooling and emerging technologies.\n\nHands‑on coding while working together with the development team and supporting it on the most complex coding tasks.\n\nQualifications\n\nAt least 5 years of practical experience with architectures of complex software solutions and systems that hold the source‑of‑truth.\n\nExperience with running own developed software in real production environments.\n\nDeep experience in relational database design (SQL)\n\nGood knowledge of JavaScript, TypeScript, NodeJS is an advantage. React as front‑end development framework\n\nHave a pragmatic rather than a dogmatic approach, always seeking for the simplicity of a solution.\n\nPractical experience working autonomously as well as within cross‑functional and agile teams.\n\nProficiency in spoken and written English.",
      "job_is_remote": false,
      "job_posted_at": "hace 9 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D5M69rRsgOPO5b8klAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "8Z_XZhg5T_C2AaarAAAAAA==",
      "job_title": "Solution Architect (Senior Manager)",
      "employer_name": "Accenture",
      "employer_logo": null,
      "employer_website": "https://www.accenture.com",
      "job_publisher": "Accenture",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.accenture.com/es-es/careers/jobdetails?id=R00285273_es&title=Solution+Architect+(Senior+Manager)&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Accenture",
          "apply_link": "https://www.accenture.com/es-es/careers/jobdetails?id=R00285273_es&title=Solution+Architect+(Senior+Manager)&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "LinkedIn",
          "apply_link": "https://es.linkedin.com/jobs/view/solution-architect-senior-manager-at-accenture-espa%C3%B1a-4295734628?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "SimplyHired",
          "apply_link": "https://www.simplyhired.es/job/uzbfYwKr_quEMshdrYeSo7u1JSTDhU2aXsK1fwsDSO4TawmZ-o0jPw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Notify",
          "apply_link": "https://notify.careers/postings/4ba7e3b2-921e-4479-96aa-72a95863591b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/7936181593205374976?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Jooble",
          "apply_link": "https://es.jooble.org/jdp/-713242671775485348?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Spain Jobs Trabajos Espana IT Tech SPanish Engineer Remote",
          "apply_link": "https://jobsinspain.net/job/solution-architect-senior-manager/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobted",
          "apply_link": "https://www.jobted.es/job/e306467e6ceb420217f1b724b41290ac?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Location: Netherlands, Spain, Poland and Italy\n\nWe are:\n\nWe are a global collective of innovators applying the New every day to improve the way the world works and lives. New doesn’t mean being ahead of the curve; new is pushing forward the curve, riding the edge where the impossible meets the transformation and making it reality where it matters. Help us show the world what’s possible as you partner with clients to unlock hidden value and deliver innovative solutions. Empowered with innovative tools, continuous learning and a global community of diverse talent and perspectives, we drive success in a new business architecture that disrupts conventional practices. Our expertise spans 40+ industries across 120+ countries and impacts millions of lives every day. We turn ideas into reality.\n\nAccenture’s Supply Chain and Operations (SC&O) partners with the world's most powerful platforms to push the boundaries of what technology can enable, empowering new ways of working and transformation at speed. With the largest and most influential tech ecosystem behind us, we play a pivotal role in helping clients accelerate their path to value.\n\nSupply Chain and Operations houses individuals who help clients develop strategies and operating models that integrate planning, procurement, product design, manufacturing, and fulfillment functions within an organization, as well as connect suppliers and customers across the extended supply chain.\n\nYou are:\n\nA Supply Chain Planning o9 Solution Architect who want to rotate to a functional lead role, that will help contribute, develop and grow our SC&O Planning business for the o9 Solutions platform, building a deep functional o9 pool of experts.\n\nThe Work:\n\nAt Accenture, Supply Chain and Operations Connected Solutions professionals develop and implement integrated supply and demand planning solutions that improve cost efficiency, increase business effectiveness, and create synergies and collaboration within an organization, as well as connect suppliers and customers across the extended supply chain. Supply Chain Planning leaders shape integrated planning and execution solutions that drive business growth while increasing supply chain resiliency.\n\nA professional at this position level within Accenture has the following responsibilities:\n• Create the architecture and design documents of o9 solution on Demand Planning, Supply Planning and IBP\n• Ensure solutions are scalable, secure, and aligned with enterprise standards\n• Help drive functional and technical design workshops on Demand Planning, Supply Planning and IBP\n• Develop custom design specifications for Gaps on Configurations\n• Design integration strategies between systems, applications, and data sources\n• Create functional design and solution design for Demand Planning, Supply Planning and IBP\n• Define data mapping needs for demand planning in o9 ref models\n• Develop POV on solution options to drive key design decisions\n• Develop testing strategy and test scenarios\n• Identify potential risks in the solution design and propose mitigation strategies\n• Quality check on solution and test results\n\nTravel may be required for this role. The amount of travel will vary from 0 to 100% depending on business need and client requirements.\n\n#LI-EU",
      "job_is_remote": false,
      "job_posted_at": null,
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D8Z_XZhg5T_C2AaarAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "HwTQLBMoJRlHz0wcAAAAAA==",
      "job_title": "IT Solution Architect",
      "employer_name": "BASF",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS9KfadQJatP7fL1Y1DaVoZxMrfTq7kZC8EmRCn&s=0",
      "employer_website": null,
      "job_publisher": "Tecnoempleo",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.tecnoempleo.com/it-solution-architect-basf/power-bi-dax-etl/rf-9abc1786b20aa3263944?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Tecnoempleo",
          "apply_link": "https://www.tecnoempleo.com/it-solution-architect-basf/power-bi-dax-etl/rf-9abc1786b20aa3263944?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Jooble",
          "apply_link": "https://es.jooble.org/rjdp/1190212431049786076?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/5360768225833385984?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Talent.com",
          "apply_link": "https://es.talent.com/view?id=901a34d4f67a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Expertini",
          "apply_link": "https://madrid.es.expertini.com/job/it-solution-architect-madrid-dxc-technology-inc-36-10245311/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/amp/job/es-madrid-it-solution-architect-m-f-d-dark-blue-emea-hiring-now-job-phh89u7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "At BASF Digital Hub Madrid we develop innovative digital solutions for BASF create new exciting customer experiences and business growth and drive efficiencies in processes helping to strengthen BASFs position as the digital leader in the chemical industry. We believe the right path is through creativity trial and error and great people working and learning together. Become part of our team and develop the future with us - in a global team that embraces diversity and equal opportunities. JOIN THE TEAM We are currently seeking a talented Solutions Architect to join our team at BASFs Agricultural Solutions department Digital Factory. RESPONSIBILITIES - Spearhead the design and implementation of the business intelligence infrastructure focusing on Power BI platforms. - Develop and maintain sophisticated data models using Power BI Desktop. - Utilize multiple sources of data for building BI reporting. - Work with data across the corporate landscape to provide data sets for the analyst team to design dashboards and reports. - Optimize Power BI reports for performance and consolidate the quantity of data sets. - Design a long-term plan for data structures and automation initiatives. - Audit existing Power BI efforts with a focus on continuous improvement. - Provide mentorship to analysts to use the data model to create reports and utilize basic DAX functions. - Lead and mentor junior resources. - Collaborate with key stakeholders to provide solutions to complex business problems. - Communicate complex concepts effectively to both technical and non-technical stakeholders. REQUIREMENTS - Extensive experience in business intelligence development with an emphasis on early-stage data integration and ETL processes. - Bachelors Degree in Computer Science or a related field or 5+ years of equivalent experience. - Proficiency in SQL DAX or similar programming languages. - Ability to communicate effectively across a diverse customer base. BENEFITS - Responsibility from day one in a challenging work environment and on-the-job training as part of a committed team. - Adequate compensation according to your qualifications and experience. - A secure work environment because your health safety and wellbeing are always our top priority. - Flexible work schedule and Home-office options so that you can balance your working life and private life. - Learning and development opportunities. - 23 holidays per year. - Another 5 days (readjustment days) and 2 days (cultural days). - A collaborative trustful and innovative work environment. - Being part of an international team and work in global projects. - Relocation assistance to Madrid provided. At BASF the chemistry is right. Because we are counting on innovative solutions on sustainable actions and on connected thinking. And on you. Become a part of our formula for success and develop the future with us - in a global team that embraces diversity and equal opportunities irrespective of gender age origin sexual orientation disability or belief.",
      "job_is_remote": false,
      "job_posted_at": null,
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DHwTQLBMoJRlHz0wcAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "pD7igX2acYXqb-AXAAAAAA==",
      "job_title": "Big Data Solutions Architect",
      "employer_name": "Databricks",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSThrxeHfeQZ7a59m7bT_8XD1BMWzLp3NlsYG3L&s=0",
      "employer_website": "https://www.databricks.com",
      "job_publisher": "JobFluent",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobfluent.com/jobs/big-data-solutions-architect-madrid-50cfb2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "JobFluent",
          "apply_link": "https://www.jobfluent.com/jobs/big-data-solutions-architect-madrid-50cfb2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jooble",
          "apply_link": "https://es.jooble.org/jdp/96926510680106927?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "BeBee",
          "apply_link": "https://es.bebee.com/job/7cb0fdd121f774b4feae2b28d2e95322?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "As a Big Data Solutions Architect (Resident Solutions Architect) in our Professional Services team you will work with clients on short to medium-term customer engagements on their big data challenges using the Databricks platform. You will provide data engineering, data science, and cloud technology projects which require integrating with client systems, training, and other technical tasks to help customers to get most value out of their data. RSAs are billable and know how to complete projects according to specification with excellent customer service. You will report to the regional Manager/Lead.\n\nThe impact you will have:\n• You will work on a variety of impactful customer technical projects which may include designing and building reference architectures, creating how-to's and productionalizing customer use cases\n• Work with engagement managers to scope variety of professional services work with input from the customer\n• Guide strategic customers as they implement transformational big data projects, 3rd party migrations, including end-to-end design, build and deployment of industry-leading big data and AI applications\n• Consult on architecture and design; bootstrap or implement customer projects which leads to a customers' successful understanding, evaluation and adoption of Databricks.\n• Provide an escalated level of support for customer operational issues.\n• You will work with the Databricks technical team, Project Manager, Architect and Customer team to ensure the technical components of the engagement are delivered to meet customer's needs.\n• Work with Engineering and Databricks Customer Support to provide product and implementation feedback and to guide rapid resolution for engagement specific product and support issues.\n\nWhat we look for:\n• Proficient in data engineering, data platforms, and analytics with a strong track record of successful projects and in-depth knowledge of industry best practices\n• Comfortable writing code in either Python or Scala\n• Working knowledge of two or more common Cloud ecosystems (AWS, Azure, GCP) with expertise in at least one\n• Deep experience with distributed computing with Apache Spark™ and knowledge of Spark runtime internals\n• Familiarity with CI/CD for production deployments\n• Working knowledge of MLOps\n• Design and deployment of performant end-to-end data architectures\n• Experience with technical project delivery - managing scope and timelines.\n• Documentation and white-boarding skills.\n• Experience working with clients and managing conflicts.\n• Build skills in technical areas which support the deployment and integration of Databricks-based solutions to complete customer projects.\n• Travel is required up to 10%, more at peak times.\n• Databricks Certification\n\nAbout Databricks\n\nDatabricks is the data and AI company. More than 10,000 organizations worldwide — including Comcast, Condé Nast, Grammarly, and over 50% of the Fortune 500 — rely on the Databricks Data Intelligence Platform to unify and democratize data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe and was founded by the original creators of Lakehouse, Apache Spark™, Delta Lake and MLflow. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.\n\nBenefits\n\nAt Databricks, we strive to provide comprehensive benefits and perks that meet the needs of all of our employees. For specific details on the benefits offered in your region, please visit https://www.mybenefitsnow.com/databricks.\n\nOur Commitment to Diversity and Inclusion\n\nAt Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.\n\nCompliance\n\nIf access to export-controlled technology or source code is required for performance of job duties, it is within Employer's discretion whether to apply for a U.S. government license for such positions, and Employer may decline to proceed with an applicant on this basis alone.",
      "job_is_remote": false,
      "job_posted_at": null,
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DpD7igX2acYXqb-AXAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "-70dANT2zZ-Nm01fAAAAAA==",
      "job_title": "Solution Architect - AWS Cloud (Madrid, Hybrid)",
      "employer_name": "Coforge",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSPCQVewYMiWyEWdQS7XyZvs90h3mEXl_PMrrHE&s=0",
      "employer_website": "https://www.coforge.com",
      "job_publisher": "Recruit.net",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.recruit.net/job/solution-architect-aws-cloud-madrid-jobs/F03F77AEAD32EB23?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Recruit.net",
          "apply_link": "https://www.recruit.net/job/solution-architect-aws-cloud-madrid-jobs/F03F77AEAD32EB23?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "Una empresa líder en soluciones tecnológicas está buscando un Arquitecto de Soluciones en Madrid. Este rol implica apoyo en la creación de soluciones alineadas con la estrategia de negocio y técnica. Se requiere fluidez en español y experiencia previa como Desarrollador de Software (Java) sería valorada. Ofrecemos un ambiente de trabajo híbrido donde se fomenta la autonomía y la colaboración en equipos ágiles. J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 7 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Comunidad de Madrid",
      "job_city": null,
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.416708799999995,
      "job_longitude": -3.5812692,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3D-70dANT2zZ-Nm01fAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "CdPY5Tpq9UeEPcyhAAAAAA==",
      "job_title": "Solution Architect - Banking Sector",
      "employer_name": "Winning",
      "employer_logo": null,
      "employer_website": null,
      "job_publisher": "Jooble",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jooble.org/jdp/-3998286282875614546?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jooble",
          "apply_link": "https://es.jooble.org/jdp/-3998286282875614546?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Spain Jobs Expertini",
          "apply_link": "https://es.expertini.com/job/solution-architect-banking-sector-madrid-winning-1961-108154115/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-solution-architect-banking-sector-winning-hiring-now-job-pfx2ei9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "At Winning Consulting, we are seeking a Solution Architect to be part of our dynamic team. This role involves working on an exciting project for one of our key clients in the banking sector in Madrid (hybrid).\n\nFunctions:\n• Lead solution design for projects covering client portals, APIs, Applications, and assisted digital tools.\n• Translate reference architectures into implementation-ready blueprints with engineering leads and product owners.\n• Bring hands-on awareness of technologies such as React/Angular, micro-frontends, REST/GraphQL APIs, microservices, and event-driven integration.\n• Contribute to client service automation, workflow design, and orchestration to enable self-service and relation manager -assisted journeys.\n• Ensure security, scalability, and compliance with architecture and regulatory standards.\n• Collaborate with Client Data and Client Services streams to enable full integration of data and service capabilities.\n• Provide technical leadership and mentoring to delivery teams; perform architecture reviews and ensure alignment with the Client Centricity roadmap.\n\nSkills:\n• Mid-senior: 8–12 years in solution or digital architecture roles within complex enterprise environments.\n• Experience designing client service automation and digital workflow integration.\n• Strong technical understanding of Client centric solutions and technologies like React/Angular front-end frameworks, REST/GraphQL APIs, microservices, and event-driven architecture.\n• Familiarity with Identity, user-management, CI/CD, Cloud/DevOps, and API management platforms.\n• Strong communication skills and ability to bridge business, and technical delivery teams. Demonstratable analytical and organisational skills.\n• Practical, hands-on approach to ensuring architectural integrity through delivery.\n\nDo you want to know more about Winning?\n\nWe are a consulting firm offering services in consulting, training, recruitment, and headhunting. We support our clients in finding innovative and sustainable solutions, ranging from applying scientific knowledge to solve complex management challenges to driving digital and technological transformation within organizations.\n\nIf you want to learn more about us, visit our website at .",
      "job_is_remote": false,
      "job_posted_at": "hace 9 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DCdPY5Tpq9UeEPcyhAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "43307100",
      "job_onet_job_zone": "2"
    },
    {
      "job_id": "wVx8dthaKcRkVFtaAAAAAA==",
      "job_title": "Solutions Architect-remoto",
      "employer_name": "Getronics",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSVafnHPMC9NCOFKFCDZQHRgI-3TBfGip_NdNGs&s=0",
      "employer_website": "https://www.getronics.com",
      "job_publisher": "Jobrapido.com",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://es.jobrapido.com/jobpreview/7592704674768093184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": true,
      "apply_options": [
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/7592704674768093184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        },
        {
          "publisher": "Talent.com",
          "apply_link": "https://es.talent.com/view?id=97ad1569bd86&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Expertini",
          "apply_link": "https://madrid.es.expertini.com/job/solutions-architect-remoto-madrid-getronics-1961-108204495/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobilize",
          "apply_link": "https://www.jobilize.com/job/es-madrid-solutions-architect-remoto-getronics-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "ph3Pre-Sales Solution Architect – Software, AI Automation /h3 pModalidad de trabajo híbrida (2 días presenciales y 3 remotos) con horario de oficina e intensiva los viernes y meses de verano. /p pLa persona que se incorpore será responsable de conectar la tecnología con las necesidades de negocio de los clientes, liderando la definición de propuestas de valor diferenciadas basadas en soluciones de desarrollo de software, inteligencia artificial y automatización. /p pSu misión será inspirar a los clientes mostrando el potencial transformador de nuestras soluciones y acompañar al equipo comercial en todo el proceso preventa, desde la detección de necesidades hasta el cierre de la oportunidad. /p h3Formación /h3 pGrado en Ingeniería Informática, Telecomunicaciones o similar. Se valorará formación adicional en ventas técnicas o gestión de soluciones tecnológicas. /p h3Idiomas /h3 pInglés a nivel profesional (oral y escrito) indispensable para la comunicación con equipos y clientes globales. /p h3Experiencia y Habilidades Técnicas /h3 ul liMínimo 5 años de experiencia en preventa o consultoría tecnológica, idealmente en empresas IT o integradores. /li liPresentaciones a clientes, elaboración de ofertas técnicas y definición de soluciones complejas. /li liConocimiento práctico en proyectos de automatización, inteligencia artificial o desarrollo de software. /li liPlataformas Cloud (Azure, AWS, GCP). /li liSoluciones de IA (LLMs, RAG, machine learning, NLP, modelos generativos) y conocimiento de herramientas de IA aplicadas al SDLC (ej. GitHub Copilot, Claude Code, Figma Make o similares). /li liRPA y automatización (UiPath, Power Automate, etc.). /li liFundamentos de desarrollo de software y arquitectura de sistemas, incluyendo patrones y mejores prácticas (ej. microservicios, DDD, TDD, event-driven architecture, arquitectura hexagonal, Clean Code, principios SOLID). /li liComprensión del ciclo de vida completo de soluciones IT (SDLC) y metodologías Ágiles (Scrum, Kanban); se valorará conocimiento de principios Lean IT. /li liTrabajo en equipo, colaboración y energía positiva. /li /ul h3Responsabilidades Diarias /h3 ul liColaborar estrechamente con el equipo comercial para comprender los retos del cliente y traducirlos en soluciones tecnológicas viables y competitivas. /li liDiseñar y presentar propuestas de valor orientadas a negocio, integrando IA, automatización, desarrollo de software y servicios cloud. /li liElaborar documentación técnica y comercial, demos, presentaciones y casos de uso adaptados a cada cliente. /li liParticipar activamente en reuniones, workshops y presentaciones con clientes y partners para posicionar las capacidades de la compañía. /li liRealizar análisis de viabilidad técnica y estimaciones de alto nivel para construir ofertas realistas y atractivas. /li liMantenerse actualizado sobre tendencias tecnológicas (IA generativa, RPA, low-code, analítica avanzada, etc.) e incorporarlas en el discurso comercial. /li liPromover un enfoque shift-left, integrando la calidad y la automatización desde las fases iniciales del diseño de la solución. /li liContribuir al desarrollo de materiales de preventa reutilizables (demos, presentaciones, casos de éxito, frameworks). /li liSer un enlace clave entre las áreas técnicas y comerciales, fomentando la colaboración y la innovación. /li /ul h3Desarrollo Profesional /h3 pPodrás crear tu propio plan de formación, seleccionando tus contenidos entre una plataforma propia con más de 15.000 opciones en las que encontrarás contenidos sobre las últimas tecnologías, metodologías ágiles, finanzas personales o salud mental, entre muchas otras opciones. /p h3Beneficios /h3 ul liRetribución flexible con opciones como ticket restaurante, guardería, transporte y seguro privado. /li liFlexibilidad horaria para compatibilizar tu vida profesional y personal. /li liRecurso remoto e híbrido para maximizar tu productividad y bienestar. /li /ul pbIgualdad de Oportunidades y Diversidad /b: Garantizamos la igualdad de oportunidades en todos nuestros procesos de selección externos e internos, generando así equipos en los que el respeto por la diversidad y el compañerismo se convierten en la mejor herramienta para lograr el éxito de nuestros proyectos. /p pFormarás parte de una comunidad diversa e inclusiva donde se evalúa únicamente por tu capacidad, experiencia y desempeño. Ponemos en valor nuestros compromisos por la igualdad, la diversidad y la inclusión en todas nuestras operaciones y acciones internas, así como en las relaciones que establecemos con clientes y demás partes interesadas. /p pbTratamiento de datos de candidato / as /b: En cumplimiento de la Ley Orgánica 3/2018 de Protección de Datos y de Garantía de los Derechos Digitales, de 5 de diciembre (LOPD-GDD) y en atención a la aplicación del Reglamento (UE) 2016/679 del Parlamento Europeo y del Consejo, de 27 de abril, relativo a la Protección de Datos de Carácter Personal (en adelante “RGPD”), le informamos que los datos personales facilitados y recogidos en esta solicitud de empleo o currículum vitae, serán tratados bajo responsabilidad de CONNECTIS FINANCIAL AND SHARED SERVICES, S.L. Le informamos que, para que dicha finalidad pueda ser desempeñada, es necesario que sus datos personales se comuniquen a otras organizaciones para informar de la capacitación técnica de nuestros candidatos. En el supuesto de producirse alguna modificación de sus datos personales, le solicitamos que nos lo comunique por escrito con la exclusiva finalidad de mantener actualizada su solicitud de empleo o currículum vitae. Los datos podrán conservarse hasta un máximo de 2 años sin actualizar. U. con domicilio en c/ Vía de los Poblados 1, edificio D, planta 2, 28033 Madrid, mediante comunicación escrita o a la dirección de correo , adjuntando copia de su DNI o documento equivalente. /p /p #J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 8 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DwVx8dthaKcRkVFtaAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "YDbmQK64l6kqD5WXAAAAAA==",
      "job_title": "Solutions Architect / MDM (ref: 1183) (Madrid)",
      "employer_name": "UpcoMinds",
      "employer_logo": null,
      "employer_website": "https://upcominds.com",
      "job_publisher": "Jobijoba",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.jobijoba.es/oferta-empleo/69/163539d94e070c5c1e1243c67b55f860?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Jobijoba",
          "apply_link": "https://www.jobijoba.es/oferta-empleo/69/163539d94e070c5c1e1243c67b55f860?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        },
        {
          "publisher": "Jobrapido.com",
          "apply_link": "https://es.jobrapido.com/jobpreview/7079714193250713600?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": true
        }
      ],
      "job_description": "Get AI-powered advice on this job and more exclusive features.\n\nDirect message the job poster from UpcoMinds\n\nWe are currently seeking a talented Solutions Architect / MDM on behalf of one of our major clients.\n\nLocation: fully remote within European Union\n\nResponsibilities Provide independent technical leadership and architectural guidance for the enterprise MDM hub, ensuring effective integration with other platforms and downstream systems.\n\nDesign and optimize scalable data models, canonical structures, business rules, and data quality frameworks, in close coordination with the company's data governance, stewardship, and architecture teams.\n\nAct as an external subject-matter expert on MDM platforms (e.g., Stibo STEP, Informatica) and integration tools, supporting internal teams with implementation and resolving complex technical challenges.\n\nPromote engineering best practices by advising on coding standards, testing strategies, observability, documentation, and system reliability across MDM initiatives.\n\nCollaborate with Product Managers, Data Architects, and business stakeholders to translate business objectives into technically sound and future-oriented architectural solutions.\n\nServe as an external mentor and advisor, supporting engineering teams through design reviews, problem-solving, and technical upskilling.\n\nDefine and recommend platform-wide KPIs (e.g., data quality, latency, availability) and advise on continuous improvement strategies for system performance and resilience.\n\nAssess and advise on emerging technologies in the areas of MDM, integration, and cloud ecosystems, evaluating their relevance and potential adoption.\n\nProvide independent technical assessments, risk evaluations, and progress updates to executive stakeholders.\n\nQualifications Many years of experience in data or software engineering roles, with a proven track record of delivering enterprise-grade MDM or Data Platform solutions.\n\nHands-on expertise with MDM platforms (e.g., Stibo STEP, Informatica), data modeling, governance, and data quality management.\n\nStrong proficiency in SQL and NoSQL (e.g., MongoDB), real-time streaming technologies like Kafka, and cloud data services (Snowflake, AWS Glue, Azure Data Factory, Databricks, etc.).\n\nExperience in distributed data architectures, microservices, and canonical modeling.\n\nDemonstrated ability to influence engineering practices at scale, drive consensus, and elevate technical standards across teams.\n\nStrong interpersonal and communication skills, able to explain complex technical concepts to both technical and non-technical stakeholders.\n\nPassion for continuous learning, experimentation, and technical excellence.\n\nPostgraduate certifications in Data Management, Cloud Platforms, or Software Engineering.\n\nExperience in retail or grocery industries with large-scale MDM implementations.\n\nFamiliarity with customer-centric data strategies and domain-driven design.\n\nExperience with capacity planning, performance optimization, and large-scale data integration.\n\nFreelancers are welcome Fully remote way of working\n\nCompetitive remuneration package\n\nPrivate Insurance\n\nA dynamic challenging environment resulting in continuous learning / education / progression\n\nAbility to work with cutting edge technologies\n\nPleasant working environment\n\nAbility to expand knowledge and responsibilities\n\nUpcoMinds is a dynamic IT company with 28 years of experience that provides end-to-end web and mobile solutions helping businesses to reinvent themselves in the digital world. Our team's skills and expertise will ensure the holistic digital transformation of any organization, which will considerably improve both business operations and customer's experience.\n\nOur goal is to always have our end products and services reflect our deep engineering skills and elegant progressive design aesthetic. We fundamentally believe deeply in developing long term strategic partnerships with our clients by exceeding expectations and maintaining a high level of transparency.\n\nFind out more about us at commit to promote Inclusion & Diversity by creating a working environment where all employees are treated with dignity and respect and where individual differences are valued. We offer equal opportunity in all aspects of employment.\n\nOur recruitment consultants will go through your Curriculum Vitae as soon as possible and get back to you to discuss the opportunity for which you apply. If you don't hear from us in the coming ten (10) working days, you may consider that you have not been selected for the particular job.\n\nNote: This posting focuses on the Solutions Architect / MDM role and the listed responsibilities and qualifications. Other job postings and extraneous UI elements have been removed for clarity.\n\nWe're unlocking community knowledge in a new way. Experts add insights directly into each article, started with the help of AI.\n\nOur aim is to promote inclusion and diversity across our workforce.\n\nFor more information, visit the company site at\n\n#J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 8 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Madrid",
      "job_city": "Madrid",
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.4167279,
      "job_longitude": -3.7032905,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DYDbmQK64l6kqD5WXAAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    },
    {
      "job_id": "kNwMWuEZx9q3V153AAAAAA==",
      "job_title": "Aerospace HW Solutions Architect – Radar & Space (Madrid)",
      "employer_name": "Akronos Technologies",
      "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWea3O1wXP4d61BIy6jIKvatHQDwwKG3O7Hb_6&s=0",
      "employer_website": "https://www.akronos-tech.it",
      "job_publisher": "Recruit.net",
      "job_employment_type": "A tiempo completo",
      "job_employment_types": [
        "FULLTIME"
      ],
      "job_apply_link": "https://www.recruit.net/job/aerospace-hw-solutions-architect-radar-jobs/C5319C1C0C40C4AE?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
      "job_apply_is_direct": false,
      "apply_options": [
        {
          "publisher": "Recruit.net",
          "apply_link": "https://www.recruit.net/job/aerospace-hw-solutions-architect-radar-jobs/C5319C1C0C40C4AE?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
          "is_direct": false
        }
      ],
      "job_description": "A technology solutions provider in Madrid is seeking a System / Solutions Architect to design and deliver advanced hardware solutions for Aerospace and Defense applications. Ideal candidates have a Master's in a relevant field and experience in designing complex RF test systems. Fluent English and Spanish are required. The role involves collaboration with global teams and customer engagement to ensure successful project execution. J-18808-Ljbffr",
      "job_is_remote": false,
      "job_posted_at": "hace 4 días",
      "job_posted_at_timestamp": null,
      "job_posted_at_datetime_utc": null,
      "job_location": "Comunidad de Madrid",
      "job_city": null,
      "job_state": "Madrid",
      "job_country": "ES",
      "job_latitude": 40.416708799999995,
      "job_longitude": -3.5812692,
      "job_benefits": null,
      "job_google_link": "https://www.google.com/search?q=jobs&gl=es&hl=es&udm=8#vhid=vt%3D20/docid%3DkNwMWuEZx9q3V153AAAAAA%3D%3D&vssid=jobs-detail-viewer",
      "job_salary": null,
      "job_min_salary": null,
      "job_max_salary": null,
      "job_salary_period": null,
      "job_highlights": {},
      "job_onet_soc": "15119900",
      "job_onet_job_zone": "4"
    }
  ]
}